[
{"title": "Research on the application of Blockchain Legal Technology in the supervision and management of online transactions", "date": "07 July 2022", "abstract": "With the development of Internet technology, China's network trading activities are becoming increasingly popular, social e-commerce, live streaming with goods and other new formats and models continue to emerge, such formats in the main body of participation, business structure, transaction process and even information dissemination methods are different from the traditional network trading activities, stimulate the vitality of the new network trading market at one way , but also caused a large numbers of legal disputes. This paper briefly analyzes the logic and characteristics of online transaction mechanism and blockchain legal technology, and discusses the legal disputes between blockchain legal technology in solving data leakage, consumer rights protection, network fraud and division of departmental responsibilities in online transactions in the current market economy environment.", "article_link": "https://doi.org/10.1145/3532640.3532647", "Authors": ["Xiaoli Guo", "Jian LI", "JingWen Hang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "BSS-ITS: Blockchain Scaling Scheme with Sharding for Intelligent Transportation System: Scale Blockchain for Better Data Exchange and Storage with Full Sharding for Intelligent Transportation System", "date": "25 February 2022", "abstract": "With the development of modern technologies, Intelligent Transportation System (ITS) has made great progress and brought convenience to every aspect of people's lives. ITS has become more complicated and uncertain due to the existing security and privacy problems. Blockchain, being a decentralized and tamper-resistant technology, can provide an environment for ITS, allowing ITS entities to perform transactions securely and trustfully. However, the inefficiency problem of blockchain, severely restricts its development and application. Studies only combine traditional blockchain with ITS, but do not consider scaling blockchain to improve performance. This paper devotes to scale blockchain that adapted to ITS, improving the efficiency of the blockchain without sacrificing the decentralization and security. A sharding scheme is proposed, which takes network sharding, data sharding and state sharding into account. Nodes are divided into several shards. Different shards can process data in parallel and store related data in their own ledger. Backup shard is put forward in this paper to enhance the shard security. And network will reshuffle when one or more shards break down. Some experiments are performed using Hyperledger Fabric and network simulator 3. Throghput, storage and delay are tested under sharding scheme and non sharding solution. The results show that sharding method is effective in scaling blockchain for ITS.", "article_link": "https://doi.org/10.1145/3510487.3510506", "Authors": ["Yufei Liu", "Jiqiang Liu", "Jian Wang", "Tianhao Liu", "Xudong He"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "Research on Design and Application of Power Dispatch Based on Blockchain", "date": "20 July 2021", "abstract": "With the large-scale access of renewable energy and the rapid development of electricity market operation, power dispatch urgently needs to improve the level of instant information sharing and service management capabilities. Through the blockchain technology, it can realize the credible sharing and traceability of key data, and further promote the efficiency of power dispatch collaboration management as well as the openness and transparency of the process of power dispatch. In this paper, the adaptability of blockchain and power dispatch business is analyzed, a power dispatch model with hierarchical management and hierarchical storage based on blockchain is proposed, and a fully functional dispatch blockchain platform is developed. Customized smart contracts are used to realize the automatic execution of the dispatch assessment and evaluation, and a consistency check mechanism is designed for the key data of the security and stability control device. Finally, two typical scenarios of dispatch management assessment and dispatch data management are selected for application research. The results show that the power dispatch model based on blockchain can significantly improve the transparency and operation efficiency of power dispatch, reduce the impact of the misoperation of the security and stability control device on the power grid, and promote the safe and stable operation of power grid.", "article_link": "https://doi.org/10.1145/3460537.3460564", "Authors": ["Rizhen Qin", "Lihua Zhao", "Da Li", "Ke Yang", "Jiaxing Xuan", "Hejian Wang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Anonymous Storage and Verification Model of IIoT Based on Blockchain: Anonymous storage and verification model of IIoT production status based on blockchain", "date": "25 February 2022", "abstract": "With the rapid development of smart industry, the data acquisition ability of edge devices in the perception layer of smart factory is gradually improved. The security of Industrial Internet of Things has increasingly become a common focus. Aiming at the data security problem in the security of industrial Internet of things, combined with the current situation of industrial Internet of things equipment, this paper proposed an anonymous storage and verification model of industrial production status which is based on blockchain. The purpose of this paper is to ensure the storage security and efficient use of industrial production data. We improve the existing Industrial Internet of Things architecture and add blockchain to participate in smart factory privacy protection and data automation processing. On this basis, anonymous storage and verification algorithm for production status, DCB (Double Color Ball) algorithm, is designed. Finally, the simulation industry platform is built, and the architecture is realized by taking the simulation industry platform as an example. The proposed structure can verify data anonymously on the premise of ensuring data security through theoretical analysis and experiment. Besides, the IIoT system still maintains a low overhead.", "article_link": "https://doi.org/10.1145/3510487.3510508", "Authors": ["Tianhao Liu", "Jiqiang Liu", "Jian Wang", "Di Zhai", "Yufei Liu", "Xudong He"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "Blockchain Enabled IoT Edge Computing", "date": "15 March 2019", "abstract": "Number of internet connected devices is increasing as IoT is getting more prevalent. Volume of data collected by IoT sensors is very high and requires considerable resources for data processing like analytics. Edge processing enables getting the sensor data processed closer to the source. It's not always possible and/or economical to set up a resource intense infrastructure at the edge. This paper proposes use of blockchain based decentralized application to enable IoT edge processing. With this setup, it is possible for a resource owner to join the ecosystem and to lend the compute resources as needed. IoT devices can offload some of the edge computation to the resource owner nodes as and when required. This paper explains architectural components and overall solution for implementation. Based on the usecase of video analytics at edge, experimental setup is implemented for the IoT edge solution using hyperledger sawtooth blockchain.", "article_link": "https://doi.org/10.1145/3320154.3320166", "Authors": ["Pankaj Mendki"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450362689", "nombredePage": "84  pages"},
{"title": "Blockchain for Data Science", "date": "29 May 2020", "abstract": "Nowadays, the development of social information and network leads to the explosive growth of data. The increasing amount and diversity of data have also encouraged researchers to make business decisions by analyzing the big data generated. This has also caused the rapid development of the data science industry. However, there are still many challenges to be solved, especially data security and privacy. Data security and privacy threat permeate every link of data science industry chain, such as data production, collection, processing and sharing, and the causes of risk are complex and interwoven. Blockchain technology is highly praised and recognized for its decentralized infrastructure, anonymity, security and other characteristics. It will change the way we access and share information. We believe that blockchain technology can overcome some limitations in data science and promote the development of data science, but it may also bring some other problems. Therefore, it is necessary to explore the relationship between blockchain technology and data science. In this paper, we investigate the researches and applications of blockchain technology in the field of data science and give the potential advantages and challenges that blockchain technology may bring to data science.", "article_link": "https://doi.org/10.1145/3390566.3391681", "Authors": ["Jiameng Liu", "Shaoliang Peng", "Chengnian Long", "Lijun Wei", "Yunhao Liu", "Zhihui Tian"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "An Adaptive State Supervising Method for Power Data Blockchain Based on Relay Mechanism", "date": "07 July 2022", "abstract": "With the continuous advancement of Power Blockchain constructions, many domestic companies have established multiple blockchain applications such as Smart Contract, Smart Finance, Energy Cloud and so on. While blockchain is in the stage of developing, thus there exists a lot of problems on these established blockchain applications. Supervision on chain data is one of these problems and it is always difficult, in order to resolve this problem, we propose a supervising method based on relay mechanism to monitor the chain data adaptively and to detect and control the abnormal data timely. We generate the data according to the data structure of the power distribution automation system for anomaly detection. The experimental results show that the proposed supervision algorithm detects abnormal power data in time, and adaptively updates the algorithm parameters according to the changes of the data on the chain, ensuring the accuracy of the detection results, and can help the supervisory unit to supervise the data on chain.", "article_link": "https://doi.org/10.1145/3532640.3532659", "Authors": ["Wenhao Xue", "Cheng Yang", "Zhuofan Wu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "A Blockchain Communication Resource Optimization Consensus Method", "date": "29 October 2022", "abstract": "Since the emergence of Bitcoin, the blockchain technology behind it has been gradually gaining attention from all walks of life. As the core of blockchain technology, the consensus algorithm determines the security, scalability and decentralization of the blockchain and many other important characteristics. The efficiency of the current blockchain consensus algorithm still needs to be improved. To address this issue, this paper proposes a consensus algorithm for communication resource optimization (CCRO), which divides consensus nodes into different domains, calculates the trust of nodes by several trust factors, and assigns different roles to nodes according to the trust. It also introduces a new class of nodes, i.e., communication nodes, which are responsible for the delivery of messages in the consensus process, and achieves the communication resource optimization of the blockchain system. By building an experimental platform, we verify the performance of CCRO, which downscales the inter-node consensus communication protocol, optimizes the regional data synchronization protocol, reduces the network communication overhead, and effectively improves the consensus efficiency.", "article_link": "https://doi.org/10.1145/3559795.3559810", "Authors": ["Jingchang Yu", "Tao Shen", "Fenhua Bai", "Zhuo Yu", "Jianzhao Luo"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450396622", "nombredePage": "143  pages"},
{"title": "PoolParty: Efficient Blockchain-Agnostic Decentralized Mining Pool", "date": "20 July 2021", "abstract": "Blockchain mining is increasingly dominated by a few centralized mining pools [1]. Large pools can censor transactions on the blockchain and can coordinate their efforts to potentially carry out a 51% attack [2]. There have been 2 previous decentralized mining pools P2Pool and SmartPool, but both had unique limitations and are no longer actively mining. PoolParty is a novel decentralized blockchain-agnostic mining pool. By using smart-contracts to validate shares and punish miner misbehavior, as well as employing fines to disincentivize cheating, PoolParty is both secure and has low overhead operating costs. PoolParty can provide 0.05% overhead costs on Ethereum, and 0.003% overhead costs on Ethereum Classic for users with 20% pool hash-power. Finally, PoolParty can be implemented on less expensive smart contract hostable blockchains to improve scalability and overhead.", "article_link": "https://doi.org/10.1145/3460537.3460554", "Authors": ["Nicholas Dana Troutman", "Aron Laszka"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Trusted Blockchain-based Data Fingerprinting Differential-Traceability and SkipList Indexing Methods in Privacy Protection", "date": "29 October 2022", "abstract": "The process of data interaction is often criticized by the public for data privacy leakage, attribution disputes, as well as being maliciously tampered with and difficult to trace the source of data. This paper proposes a data privacy protection and fingerprint tracing method based on the features of decentralization, traceability and non-tampering in blockchain technology. And we combined with the protection of data by secure network platform in trusted computing and differential-traceability algorithm (DTA). We propose a data privacy protection and fingerprint traceability method, and use the SkipList table index structure to improve interaction efficiency. We discuss the proposed data fingerprint-based traceability framework model in a trusted environment using the features of blockchain and trusted computing platforms. In this paper, the data can be processed safely and efficiently to solve the privacy problem, the transaction data is encrypted and recorded on the chain by DTA, and the interaction process uses the SkipList table index to enhance retrieval efficiency. Finally, through multiple experiments and comparison of the results obtained from security testing, it is verified that the blockchain-trusted computing data privacy protection and data fingerprint traceability SkipList table indexing method can achieve traceability for data privacy protection, transaction security management and peer-to-peer verification of encryption and decryption algorithms. We not only provide a secure, trustworthy and efficient data privacy protection model, but also bring a time efficiency optimization of 6ms per 10,000 queries.", "article_link": "https://doi.org/10.1145/3559795.3559806", "Authors": ["Jiazheng Zhang", "Fenhua Bai", "Tao Shen", "Bei Gong", "Jianzhao Luo"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450396622", "nombredePage": "143  pages"},
{"title": "Towards a Blockchain Deployment at UAE University: Performance Evaluation and Blockchain Taxonomy", "date": "15 March 2019", "abstract": "Blockchain technology initially developed for transactions on cryptocurrencies is now gaining popularity in major domains such as education, healthcare, media, government, smart computing, and business enterprise. Blockchain manages the transactions database in a decentralized way replicated on all the nodes with no single governing authority. In this paper, we present a classification and taxonomy of different blockchain development platforms and simulators along with their consensus protocols, the types of supported blockchain networks and programming languages. We also assess the performance of a blockchain application for deployment at the UAE University (UAEU) versus increasing number of nodes, blocks and block size, on top of experimental network latencies and bandwidth between the nodes. Our results show that a large-scale deployment of blockchain at UAEU is feasible.", "article_link": "https://doi.org/10.1145/3320154.3320156", "Authors": ["Leila Ismail", "Heba Hameed", "Mahra AlShamsi", "Manayer AlHammadi", "Noura AlDhanhani"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450362689", "nombredePage": "84  pages"},
{"title": "IOT Security Issues Via Blockchain: A Review Paper", "date": "15 March 2019", "abstract": "In the past few years block chain has gained lot of popularity because blockchain is the core technology of bitcoin. Its utilization cases are growing in number of fields such as security of Internet of Things (IoT), banking sector, industries and medical centres. Moreover, IoT has expanded its acceptance because of its deployment in smart homes and city developments round the world. Unfortunately, IoT network devices operate on limited computing power with low storage capacity and network bandwidth. Thus, they are extra close to attacks than other end-point devices such as cell phones, tablets, or PCs. This paper focus on addressing significant security issues of IoT and maps IoT security issues in contradiction of existing solutions found in the literature. Moreover issues that are not solved after implementation of blockchain are highlighted.", "article_link": "https://doi.org/10.1145/3320154.3320163", "Authors": ["Abid Sultan", "Muhammad Azhar Mushtaq", "Muhammad Abubakar"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450362689", "nombredePage": "84  pages"},
{"title": "Blockchain Analysis Tool of a Cryptocurrency", "date": "29 May 2020", "abstract": "In recent years, cryptocurrencies have become more and more popular and the growing adoption has led to an increasing number of financial transactions being stored on the blockchain. Although cryptocurrencies have built a reputation as an anonymous means of payment, they are usually rather pseudonymous, transparent and everlasting logbooks about financial transactions, which are publicly available. Thus, analyzing a crypto address can reveal payment partners, money flows, behavior patterns and more. In this work, a program is presented, which provides an analysis of this kind and displays the results in a simple format. The technical properties of the blockchain that this analysis is based on are explained. This paper explains the possible impact of total transparency on the blockchain and our tool on our society.", "article_link": "https://doi.org/10.1145/3390566.3391671", "Authors": ["Robert Werner", "Sebastian Lawrenz", "Andreas Rausch"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "A Comparative Study of Blockchain-Based DNS Design", "date": "20 March 2020", "abstract": "With the rapid development of Internet, security and privacy of the Domain Name System (DNS) are becoming increasingly important. Thanks to its decentralized structure and immutability, blockchain technology has the potential to address relevant security and privacy challenges in the DNS. In this paper, we survey the blockchain-based DNS for different architectures. We envision our study to motivate more studies on the DNS based on the blockchain.", "article_link": "https://doi.org/10.1145/3376044.3376057", "Authors": ["Yang Liu", "Yuwen Zhang", "Siyu Zhu", "Cheng Chi"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "Practical Blockchain-Based Financial Assets Tokenization", "date": "25 February 2022", "abstract": " Financial institutions own balanced portfolios with different types of assets, resulting in a low-risk investment. At the same time, assets cannot be broken down into smaller parts with comparable risk for resale owing to regulators’ restrictions caused by a lack of auditability. Blockchain overcomes this issue with smart contracts. By now, the way to tokenize financial assets into a commodity is known. In this paper, we provide technical details for tokenization. Namely, an artificial dataset from Forex data is constructed for demonstration purposes; two tokenization algorithms are implemented and applied to the dataset; ERC1155-based smart contract is implemented and applied to the algorithms’ output to perform sold-out and secondary market steps. The source code is openly available.", "article_link": "https://doi.org/10.1145/3510487.3510495", "Authors": ["Yatipa Chaleenutthawut", "Vyacheslav Davydov", "Aleksandr Kuzmin", "Yury Yanovich"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "Machine Learning View on Blockchain Parameter Adjustment", "date": "02 October 2021", "abstract": " A fundamental problem in distributed computing is achieving agreement among many parties for a single data value in the presence of faulty processes–to get consensus. The consensus mechanism is an underlying part of blockchain design and commits new blocks and changes protocol itself. In addition to classic correctness requirements, blockchains need specific ones: high performance regarding transactions per second, fast transaction confirmation, etc. Blockchains control the requirements with parameters. But how to meet qualitative and optimize quantitative requirements? Typically we have the main blockchain network without access to try different parameters and the test network to do whatever we want. In the paper, we provide a machine learning view on the blockchain parameter adjustment. We list the blockchain parameters for Solana blockchain and apply feature importance to select the most significant parameters during the forthcoming optimization.", "article_link": "https://doi.org/10.1145/3475992.3475998", "Authors": ["Vladislav Amelin", "Nikita Romanov", "Robert Vasilyev", "Rostyslav Shvets", "Yury Yanovich", "Viacheslav Zhygulin"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389518", "nombredePage": "82  pages"},
{"title": "Dos and Don’ts in Blockchain Research and Development", "date": "07 July 2022", "abstract": " The goal of this paper is to clarify common misconceptions regarding the blockchain technology, and pointing out some worrisome practices in the field of blockchain technology. We first provide a brief introduction of the blockchain technology, highlighting its design principle, nuts and bolts, and the most fundamental innovation of the technology. Next, we elaborate on a key concept regarding data immutability. In particular, it is a mistake to equate blockchain to data immutability. Data immutability can only be achieved in large-scale public blockchains where the cost becomes an insurmountable barrier for any attempt to change the data recorded in the blockchain. The third topic we discuss is the differences between public, private, and consortium blockchains. We caution the use of private and consortium blockchains. The last topic we argue is regarding blockchain consensus. Because the proof of work (PoW) consensus algorithm has obvious drawbacks on energy consumption, many alternative algorithms have been proposed. We single out two most egregious wrong practices: (1) selecting a small set of validators for reaching consensus, and (2) adopting traditional distributed consensus.", "article_link": "https://doi.org/10.1145/3532640.3532646", "Authors": ["Wenbing Zhao", "Shunkun Yang", "Xiong Luo", "Jiong Zhou"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "Ring Signature-Based Voting on Blockchain", "date": "20 March 2020", "abstract": "Amid ongoing digitalization, the use case of electronic voting has naturally arisen, with attempts beginning as early as 2000. Blockchain technology has the potential to bring trust and built-in auditing tools to such systems. This paper presents a prototype of the system for collective voting. It is based on blockchain and linkable ring signatures to ensure the transfer of closed (secret) data without the loss of reliability and with respect for the privacy of group members.", "article_link": "https://doi.org/10.1145/3376044.3376054", "Authors": ["Alexandra Kugusheva", "Yury Yanovich"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "A Blockchain-based Electricity Retail Contracts Management System", "date": "29 October 2022", "abstract": "With the development of the electricity market, the number of retail contracts generated by the electricity purchasers is increased rapidly. The traditional contracts management methods have gradually revealed disadvantages such as contracts loss, delayed update, and data tampering. As a result, the ensuing retail contracts disputes have also become more and more frequently. In terms to handle with such issues, we proposed a blockchain-based electricity retail contracts system, which utilizes immutability and traceability of blockchain. Leveraging the immutability and traceability of blockchain, our system can effectively store retail contracts which alleviates the problem of existing contract disputes. Moreover, we combine Inter-Planetary File System (IPFS) with blockchain to solve the storage problem. In addition, the data security of our system is guaranteed through the reasonable use of some means of authentication, digital signatures and access control.", "article_link": "https://doi.org/10.1145/3559795.3559802", "Authors": ["Rui Zhou", "Kangan Shu", "Dejun Xiang", "Hang Sun", "Yang Liu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450396622", "nombredePage": "143  pages"},
{"title": "A blockchain enhanced book lending system for college library", "date": "07 July 2022", "abstract": "The limited storage space of the library cannot support the continuous expansion of the book stock. Based on the contradiction between the collection and use of books, \"collecting books for the people\" may be a solution. A discrete lending model is built by blockchain technology to break through the library space for book lending. The system automatically executes the lending incentive mechanism on the smart contracts and uses the tokens in the blockchain platform as assets to complete the transaction. An auction mechanism model is proposed based on tokens and the discrete space of users to solve the problem of discretized borrowing of readers. Meanwhile, a queuing model is used to verify the feasibility of the system. Results show that the blockchain-based lending system shortens the average waiting time than traditional lending services. The blockchain lending method helps solve the shortage of library space resources and improves users' lending experience.", "article_link": "https://doi.org/10.1145/3532640.3532663", "Authors": ["Xuming Zhang", "Xiao Zhang", "Rende Li"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "Blockchain Enabled IoT Edge Computing: Addressing Privacy, Security and other Challenges", "date": "29 May 2020", "abstract": "The earlier work related to this paper described blockchain enabled IoT edge computing architecture, where any compute resource owner can join the ecosystem and lend out the compute resources required for edge computing/analytics. This paper lists possible set of challenges implementing the above solution. The primary challenges are ensuring data privacy for the input data files and ensuring computation integrity when executing the computation remotely. The paper talks about current state research and possible practical implementation to address the privacy and integrity challenges using hardware assisted trusted executing environment primarily Intel SGX. The paper proposes using unidirectional payment channels to address payment related challenges.", "article_link": "https://doi.org/10.1145/3390566.3391689", "Authors": ["Pankaj Mendki"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Blockchain Based Digital Evidence Chain of Custody", "date": "29 May 2020", "abstract": "With the development of technology, the preservation of digital evidence becomes increasingly important in case investigations. To maintain the authenticity of an evidence, its entire lifecycle has to be recorded. In addition, traditional database technologies are not able to maintain the integrity and authenticity of digital evidence. In order to achieve authentication and integrity, as well as confidentiality, of digital evidence, we propose a protocol for digital evidence chain of custody based on revocable ciphertextpolicy attribute-based encryption, BLS signature, and blockchain technology. In our protocol, attribute-based encryption is used to achieve fine-grained access control and BLS signature is used to verify digital evidence. Besides, we use blockchain technology to ensure the integrity and traceability of digital evidence. Analysis and experimental results show that the proposed protocol, which well balances the privacy and the traceability, guarantees the integrity and validity of evidence.", "article_link": "https://doi.org/10.1145/3390566.3391690", "Authors": ["Wenqi Yan", "Jiachen Shen", "Zhenfu Cao", "Xiaolei Dong"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Application of Blockchain Technology in Oil and Gas Industry", "date": "20 July 2021", "abstract": "Distributed ledger, also known as blockchain technology, or BT for short, is an Internet database technology, which is characterized by decentralization, openness and transparency, allowing everyone to keep records in a database. It is an emerging technology that has set off a wave of global investment after big data, cloud computing, artificial intelligence, etc. As the underlying technology of Bitcoin, blockchain technology is an Internet database technology which is essentially to record data and contracts along the time axis. This technology has already brought tremendous changes in finance, security and other fields, and is expected to do the same in the oil and gas industry. With oil and gas exploration and development undergoing digital transformation, blockchain technology is one of the most promising digital technologies.", "article_link": "https://doi.org/10.1145/3460537.3460538", "Authors": ["Jian Sun", "Gufan Zhao", "Ruiyao Wang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Supply Chain Finance in Blockchain-based Digital Asset Platform", "date": "07 July 2022", "abstract": "Assets such as warehouse receipts and pre-sale certificates are important for enterprises,which can be used to pledge in supply chain finance. In China, traditional supply chain finance is done manually by the bank side, which inevitably encounters problems such as multiple pledges and unclear rights on assets. In this paper, we propose a blockchain-based digital asset platform (DAP), which not only embeds digital signatures and smart contracts to improve the reliability of supply chain finance between enterprises and banks but also the data stored on the DAP blockchain makes traceability possible. Besides, DAP is built on DNA-based Consortium blockchain and threshold ECDSA Algorithm, which is autonomous and controllable. Moreover, subsequent performance tests show that DAP has a high ability to process transactions and has a greater potential for application.", "article_link": "https://doi.org/10.1145/3532640.3532650", "Authors": ["Zhefu Feng", "Hongfei Da", "Min Xiao", "Chen Zhao", "Zongyang Zuo", "Jiayin Qi"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "Blockchain Technology as an Approach for Data Marketplaces", "date": "15 March 2019", "abstract": "In the digital Economy 'Data is the new oil. In the last decade technology has disrupted every filed imaginable. One such booming technology is Blockchain. A blockchain is essentially a distributed database of records or public ledger of all transactions or digital events that have been executed and shared among participating parties. And once entered, the information is immutable. Ongoing projects and prior work in the fields of big data, data mining and data science has revealed how relevant data can be used to enhance products and services. There are uncountable applications and advantages of relevant data. The most valuable companies of today treat data as a commodity, which they trade and earn revenues.", "article_link": "https://doi.org/10.1145/3320154.3320165", "Authors": ["Sebastian Lawrenz", "Priyanka Sharma", "Andreas Rausch"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450362689", "nombredePage": "84  pages"},
{"title": "Blockchain-based Supply Chain Financial Services Using Smart Contract", "date": "25 February 2022", "abstract": "Supply chain finance (SCF), a proposal to address financing problems of small and medium enterprises (SMEs), aims to make working capital optimized by utilizing credit and transaction information through cooperation between upstream and downstream in the supply chain. But some demerits such as information asymmetry and the lack of trust in financing scenarios could still be witnessed in supply chain finance. Blockchain technology, with the characteristics of asymmetric encryption, decentralization, nonrepudiation, and conducting transactions without the supervision of a trusted third party, has revolved multiple stages of development. Smart contracts are regarded as an important derivative technology of blockchain, which are automatically executed by the code between multiple parties through the blockchain without relying on a trusted institution. In this paper, we propose a blockchain-based supply chain financial system combining smart contracts and main methods of supply chain financing to solve the disadvantages of SCF. We select three represented financing modes to design financing platforms with the introduction of smart contracts, and present our schemes in the form of specific pseudo code. All financing processes of supply chain are conducted on the basis of ethereum blockchain. This allows SMEs which have difficulty in capital turnover in the short term, or have insufficient credit to get financial loans more easily compared with traditional financing approaches due to merits of blockchain, and also this could facilitate supply chain to improve financing efficiency for SMEs.", "article_link": "https://doi.org/10.1145/3510487.3510497", "Authors": ["Xiaocong Yu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "A Time-Segmented Consortium Blockchain for Robotic Event Registration", "date": "20 July 2021", "abstract": "A blockchain, during its lifetime, records large amounts of data. In a robotics environment, the old information is useful for human evaluation, or to perform analysis, but it is not useful for robots that require only current information to continue their work. This causes a storage problem in Blockchain nodes as in the case of nodes attached to robots that are usually built around embedded solutions. This paper presents a time-segmentation solution for devices with limited storage capacity, integrated into a particular robot-directed Blockchain called RobotChain. The experiments conducted show that the goal of restricting each node's capacity is reached without compromising all the benefits that arise from the use of Blockchains in these contexts and it allows for cheap nodes to use this Blockchain, reducing storage costs and allowing faster deployment of new nodes.", "article_link": "https://doi.org/10.1145/3460537.3460557", "Authors": ["Vasco Lopes", "Nuno Pereira", "Miguel Fernandes", "Luis A. Alexandre"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Design of Logistics Cloud Platform Based on Blockchain", "date": "29 October 2022", "abstract": "The emergence of Internet technologies such as big data, artificial intelligence, and blockchain has helped the logistics industry enter the fast lane of development. In recent years, the logistics cloud platform, as a new model of Internet + logistics development, can integrate all the information of service supply chain providers and realize the digitization and networking of logistics resources. However, limited by the existing technology and management mechanism, the development of my country's logistics cloud platform is still in its infancy, and the phenomenon of uneven distribution of power and information asymmetry is expected, which limits the willingness of enterprises to share information to a certain extent. It is also not conducive to the long-term development of the logistics cloud platform. Because of this, this paper builds a logistics cloud platform based on blockchain technology, and explores and solves the problem of information sharing among nodes on the logistics cloud platform. Firstly, analyze the goals and participants of the logistics cloud platform, and then combine the factors that affect information sharing, use blockchain technology to build a logistics cloud platform and outline its functions, and finally compare it with the traditional supply chain, highlighting the blockchain logistics cloud platform The advantages. It is hoped that by building this platform to encourage relevant logistics enterprises to share information, so as to promote the development of the entire logistics industry.", "article_link": "https://doi.org/10.1145/3559795.3559809", "Authors": ["Qin Wang", "Xinke Du"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450396622", "nombredePage": "143  pages"},
{"title": "DeExam: A Decentralized Exam Administration Model using Public Blockchain", "date": "02 October 2021", "abstract": "In exams, which are intended to evaluate capability, it is practically difficult to detect errors or mistakes made by test providers and scorers, as the correct/incorrect decision logic is often not disclosed. Therefore, we propose a sustainable exam administration model with enhanced reliability and transparency, utilizing a public blockchain, without a centralized authority. The blockchain records the hash values of the correct answers, decision condition, and decision result, which cannot be tampered with afterward. We implemented our proposed method using Bitcoin Core and used it to conduct a CTF (Capture The Flag) competition with over 100 participants. No fatal flaws were observed, thereby confirming the viability of the method.", "article_link": "https://doi.org/10.1145/3475992.3475993", "Authors": ["Yusuke Kaneko", "Shuntaro Tanaka", "Tomoyuki Kimura", "Jun Okumura", "Shigeyuki Azuchi", "Shigeyuki Osada"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389518", "nombredePage": "82  pages"},
{"title": "Dynamic Security Mechanism for Lightweight IoT Devices Access to Blockchain Services", "date": "25 February 2022", "abstract": "Internet of things (IoT) devices are usually unable to run a full blockchain node or even a blockchain Software Development Kit (SDK) client due to limited hardware resources. To let IoT devices be able to securely connect to blockchain services, a design based on blockchain SDK proxy node is proposed. The blockchain SDK proxy node runs the blockchain SDK client. IoT devices just need to construct and sign the blockchain transactions, then send the signed data through Application Programming Interfaces (APIs) provided by the proxy node. The proxy node forwards the data to the blockchain network. However, a static proxy node will become the single point of performance bottleneck and failure, which is vulnerable for DDoS attacks. To further improve the security, a mechanism of dynamically selecting a proxy node is designed to make IoT devices access to blockchain services safely and efficiently.", "article_link": "https://doi.org/10.1145/3510487.3510489", "Authors": ["Jian Zhao", "Jinjing Liu", "Lin Lin", "Lixin Liang", "Hua Wang", "Shaohua Xiang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "A Survey of Blockchain Based on E-voting Systems", "date": "20 March 2020", "abstract": "Blockchain technology as a decentralized and distributed public ledger in a P2P network has recently gained much attention. In this technology, a linked block structure is applied, and a trusted consensus mechanism is established to synchronize data modifications, making it possible to develop a tamper-proof digital platform for data storage and sharing. We think that blockchain could be used in various interactive online systems, such as the Internet of Things, supply chain systems, voting systems, etc. The scope of this survey is to shed light on some recent contributions of the security and privacy issues associated with e-voting based on blockchain. At the end of this paper, we provided a comparison for the security and privacy requirements of the existing e-voting systems based on blockchain.", "article_link": "https://doi.org/10.1145/3376044.3376060", "Authors": ["Yousif Abuidris", "Rajesh Kumar", "Wang Wenyong"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "Increasing the Confidence of the Brazilian Livestock Production Chain using Blockchain", "date": "20 March 2020", "abstract": "This paper presents the application of the blockchain technology to the traceability problem in the production chain of Brazilian livestock. First, the context is introduced and the socio-environmental challenges are presented. A new methodology, Context-Based Blockchain Platform Definition and Analysis Methodology (MetaBlockX), is explained, showing how it was applied to the problem and the result obtained, which indicates the platform for the development of blockchain applications that has more adherences to the Positive Livestock Project's context. Then, the solution is presented, followed by the scenario description, the conclusions and further work.", "article_link": "https://doi.org/10.1145/3376044.3376058", "Authors": ["Vasco V. Picchi", "Eduardo F. J. de Castro", "Fernando C. H. Marino", "Sérgio L. Ribeiro"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "An Anonymous Transmission Algorithm Named Ripple Spreading for Blockchain", "date": "29 May 2020", "abstract": "The emergence of blockchain technology profoundly reflects the importance of anonymity in personal data and personal identity. In this paper, we propose an anonymous transmission algorithm named ripple spreading specialized in anonymous payment in the blockchain network. The algorithm achieves the purpose of anonymous transmission by transmitting verification while jumping among multiple nodes, thereby, overcomes the defect of the lack of covert channel characteristics under the web environment. We firstly demonstrate the framework of our algorithm. Subsequently, we illustrate the converging and merging process of transmission in detail, and lastly, give a quantitative evaluation of this algorithm. The result of the experiment shows that once the number of paths as well as the average path length reaches a threshold, our algorithm can solve the main problem of anonymous transmission to a great extent and improve the anonymity function significantly.", "article_link": "https://doi.org/10.1145/3390566.3391682", "Authors": ["Yongwang Zhou", "Zhuchao Yu", "Yixiao Lan", "Yuxin Guo", "Ruinan Chen"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Consensus in Blockchain Systems with Low Network Throughput: A Systematic Mapping Study", "date": "02 October 2021", "abstract": " Blockchain technologies originate from cryptocurrencies. Thus, most blockchain technologies assume an environment with a fast and stable network. However, in some blockchain-based systems, e.g., supply chain management (SCM) systems, some Internet of Things (IoT) nodes can only rely on the low-quality network sometimes to achieve consensus. Thus, it is critical to understand the applicability of existing consensus algorithms in such environments. We performed a systematic mapping study to evaluate and compare existing consensus mechanisms’ capability to provide integrity and security with varying network properties. Our study identified 25 state-of-the-art consensus algorithms from published and preprint literature. We categorized and compared the consensus algorithms qualitatively based on established performance and integrity metrics and well-known blockchain security issues. Results show that consensus algorithms that rely on synchronous network for correctness cannot provide the expected integrity. Such consensus algorithms may also be vulnerable to distributed-denial-of-service (DDOS) and routing attacks, given limited network throughput. Conversely, asynchronous consensus algorithms, e.g., Honey-BadgerBFT, are deemed more robust against many of these attacks and may provide high integrity in asynchronous events.", "article_link": "https://doi.org/10.1145/3475992.3475995", "Authors": ["Henrik Knudsen", "Jakob Svennevik Notland", "Peter Halland Haro", "Truls Bakkejord Raeder", "Jingyue Li"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389518", "nombredePage": "82  pages"},
{"title": "Blockchain Adoption for Plea Bargaining of Corporate Crime in Indonesia", "date": "29 May 2020", "abstract": "The rise of corporate crime cases now shows that the handling has not found the right model, even though so far there has been a concept of legal settlement outside the court, otherwise known as plea bargaining. In addition to those who support, there are criticisms of the use of plea bargaining (such as too much discretion of prosecutors in plea bargaining, lack of legal substance that limits the possibility of abuse of authority by law enforcement officials, and the possibility of guilty plea not yet actual), but this criticism can be refuted through the use of blockchain technology in the mechanism of plea bargaining. In Indonesia, the regulation of the bargaining of corporate crime plea is still limited to the draft law. In fact, the draft is still not in accordance with the spirit of plea bargaining itself, such as the defendant whose plea bargaining application was received must still be tried through a short event examination, it does not regulate which types of criminal acts are categorized as special lines, bidding restrictions or negotiations between the defendant and the claimant general, and what form of waivers or rewards or concessions can be offered by public prosecutors. This shows the importance and urgency to build a transparent, efficient, fast and inexpensive plea bargaining model in Indonesia through the use of blockchain technology. In addition, the use of blockchain technology can provide adequate outputs and outcomes in dealing with corporate crime, because any data, information, complaints, and reports that are inputted based on each block will be automatically integrated into the fairness, legal certainty, and public benefit values as an independent and accountable decisionmaking tool for the authorities.", "article_link": "https://doi.org/10.1145/3390566.3391680", "Authors": ["Henry Dianto P. Sinaga", "Andhy H. Bolifaar"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "CoVID-19 Vaccination Certificate Supply Verification Based on Blockchain", "date": "25 February 2022", "abstract": " The emergence of the pandemic, Covid-19, impacted the worldwide economy. The daily scientific development helped in creating a vaccine against the virus. In order to limit the spread of the virus, government authorities are making it mandatory for vaccination certificates for people to run businesses or access public facilities like theaters, restaurants, etc. The government mandate of vaccine certificates compelled people to purchase fake certificates and fake entities to provide fake certificates. This paper provides an application-based blockchain solution for registering vaccinating authorities to vaccinate and provides relevant vaccine certificates that anyone can verify in no time. Additionally, analysis of data retrieving from the blockchain is provided because the data reading will be happening by thousands of authorities. The code for the prototype application is available on Github.", "article_link": "https://doi.org/10.1145/3510487.3510500", "Authors": ["Yash Madhwal", "Yury Yanovich", "Ilya Chumakov"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "Creating Lean and Agile Supply Chains with Blockchain", "date": "20 July 2021", "abstract": "This paper aims to explore how blockchain technology can help us to achieve supply chains that are agile but also lean, which is also demanded by the modern business environment. A role playing simulation was used to evaluate the benefits provided by different levels of visibility in a typical supply chain. A distributed ledger enabling supply chain visibility was designed. A supply chain performance framework was developed in order to measure the supply chain performance from both lean and agile aspects. The results show a significant correlation in performance with the degree of visibility, but it is not a linear relationship. An effective LeAgile supply chain can be achieved with the enhancement of visibility. In order to implement visibility, an appropriate information sharing frequency (drumbeat) is needed. Blockchain allows users to more securely and transparently track all types of transactions, to improve Supply Chain Visibility. We also find the complex relationship between trust and visibility. This is one of the first papers, taking human factors into consideration, to investigate how blockchain technology can be used to enhance supply chain visibility, which is needed for leagile supply chain performance.", "article_link": "https://doi.org/10.1145/3460537.3460558", "Authors": ["Ruijuan Zhao", "Jay Bal", "Xiao Ma"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "A Blockchain-Based Deposit System to Reduce WEE", "date": "29 May 2020", "abstract": "Nowadays, electronics/electrical appliances are becoming less and less appreciated. Due to ever shorter innovation cycles, especially in the field of consumer electronics, more and more electrical waste is being produced. Motivated by this fact we decided to face this challenge in a course called programming project course. There we introduced the problem and further the blockchain technology. The task was to design a blockchain-based solution to reduce Waste Electrical & Electronic Equipment (WEE) and so to improve sustainability. The final idea here was to establish a deposit system for WEE. In this paper, we present the programming project from the development process of the first ideas to the completion of the running prototype and discuss the results.", "article_link": "https://doi.org/10.1145/3390566.3391686", "Authors": ["Sebastian Lawrenz", "Vera Stein", "Lukas Jacobs", "Andreas Rausch"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Occupation mechanism for eliminating double-spending attacks on trusted transaction blockchain", "date": "20 July 2021", "abstract": "Using blockchain technology to build a trusted transaction foundation has become a hot topic of current research and practice. The double-spending phenomenon refers to the bifurcation of the blockchain structure. In the process of trusted transactions, the fork caused by malicious attacks will destroy the correctness, integrity, and consistency of the entire ledger, and causes serious economic losses to users. Therefore, eliminating double-spending attacks is an important issue to ensure the security of the blockchain. The current method of defending against double-spending attacks in trusted transactions mainly revolves around the Bitcoin blockchain system. In the process of researching the Nano blockchain grid project, a high-throughput trusted transaction system, we proposed a double-spending elimination solution for the system: the occupying mechanism. By using Java to reconstruct the Nano project and implement the occupying mechanism, the experimental results verify the effectiveness of the occupying mechanism, and it is superior to the Nano project's double-spending solution based on the traditional voting mechanism in terms of time performance.", "article_link": "https://doi.org/10.1145/3460537.3460543", "Authors": ["Yu-Yan Zhang", "Meng-Yan Huang", "Xu Zhang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Loan Chain: A Blockchain-Based Framework for Smart Credit Lending", "date": "29 October 2022", "abstract": "Abstract. Credit transactions require an extra level of security, trust, and privacy. Although the bank's credit transaction system technology has gradually improved, it still has high labour costs, inefficiencies, and security concerns. This study proposes a standardized blockchain application model in fintech and discovers that blockchain has broad prospects that can be realized through distributed consensus, smart contract execution, cryptographic algorithms, and distributed ledgers, which increase transparency, efficiency, and fairness in the financial industry. This study also deployed an automated machine learning system at the stage where banks qualify borrowers, optimizing the original credit model.", "article_link": "https://doi.org/10.1145/3559795.3559797", "Authors": ["Yibai Wang", "Yiyang Liu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450396622", "nombredePage": "143  pages"},
{"title": "A Hierarchical Blockchain-based Data Service Platform in MEC Environments", "date": "29 May 2020", "abstract": "Recently, data service companies analyzing IoT data to provide valuable knowledge emerge as a promising business model. To sustain such business model, the establishment of a data service platform for IoT data sharing and data service delivery becomes a necessity. Today, blockchain-based platforms are believed to be reliable but have poor system performance, considerable storage overheads and high energy consumption. MEC technology is then applied to help IoT devices participate in the blockchain network. However, the considerable loading of blockchain operations turns MEC hosts into a performance bottleneck, instead. Therefore, this paper exploits the hierarchical blockchain architecture in the proposed IoT data service platform, called HB-IoDS, to significantly reduce the storage overheads and service providing time. Furthermore, to alleviate the heavy burdens on MEC hosts, HB-IoDS provides the adaptive Proof-of-Work (APoW) consensus algorithm that derives an appropriate difficulty to achieve PoW condition according to device capability. By this mean, resource-constrained IoT devices can also perform blockchain operations which are usually regarded as energy-consuming. Finally, simulation results show that HB-IoDS outperforms existing blockchain-based platforms in terms of system performance, energy consumption, and storage costs. As a result, the proposed HB-IoDS is the most practical IoT data service platform.", "article_link": "https://doi.org/10.1145/3390566.3391674", "Authors": ["I-Hsun Chuang", "Shau-Hsien Chiang", "Wei-Chu Chao", "Shih-Hao Huang", "Bai-Lin Zeng", "Yau-Hwang Kuo"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "On Parallel Mechanism of Consortium Blockchain: Take PoV as an example", "date": "20 July 2021", "abstract": "Blockchain is an emerging distributed storage technology in recent years. It can hold all historical data, transaction records, and other related information from the past by using a self-referencing blockchain data storage structure. Consensus is the core technology of blockchain, which ensures consistency of data of different nodes and also enables the blockchain to have Byzantine fault tolerance. However, most consensus algorithms are serialized. With the increase in the number of nodes, throughput of system decreases rapidly. Proof of Vote (PoV) is an efficient voting-based consensus algorithm. It separates the voting and bookkeeping rights and has a great traffic complexity of . Based on PoV, we propose a more efficient and practical consensus algorithm called Parallel Proof of Vote (PPoV), which allows multiple nodes to generate blocks in parallel within a consensus cycle. Analysis and experiments show that the performance of PPoV is 2-5 times higher than typical BFT consensus as the number of nodes in range of 4-100.", "article_link": "https://doi.org/10.1145/3460537.3460560", "Authors": ["Yongjie Bai", "Yang Zhi", "Hui Li", "Han Wang", "Ping Lu", "Chengtao Ma"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "An E-resource Sharing Solution Based on Blockchain Technology", "date": "25 February 2022", "abstract": "By analyzing the problems existing in the sharing platform of e-resource, such as data trust, single point of failure, virtual data property rights disputes, etc, the collection, sorting, display, sharing and other problems of e-resource can be solved with the help of the distributed ledger of blockchain and multi-party consensus, so as to effectively improve the sharing effect of e-resource. The paper analyzes the feasibility of block chain to solve the problem of e-resource sharing through literature research. By drawing on the experience of block chain in the medical field, the paper designs an e-resource sharing scheme based on block chain technology. The scheme is secondary developed on the existing electronic resource sharing platform, and Fabric alliance chain framework and IPFS distributed file storage technology in blockchain are introduced. A four-layer structure model is designed, and the interaction between server, IPFS and Fabric is defined. The semi-structured interview evaluation of participants confirmed that the scheme could improve the availability, reliability and efficiency of the e-resource sharing platform. The proposal can effectively promote the digitalization of modern electronic resources.", "article_link": "https://doi.org/10.1145/3510487.3510502", "Authors": ["Minna Liu", "Thelma Palaoag", "Wei Zhang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "A Distributed Storage System Based on Blockchain Technology: Named Practical Distributed File System", "date": "07 July 2022", "abstract": "As an emerging business model in the storage industry, distributed storage contains a broad market prospect. Based on blockchain technology, distributed storage not only meets the storage needs in the era of big data by storing huge amount of data evenly in different nodes of the network, but also can reach autonomy under the consensus mechanism. However, due to the complexity of technology integration and design flaws, now distributed storage still faces huge challenges in practical application, specifically in terms of disaster recovery mechanism, hot data storage, and accessible threshold. In this paper, we firstly introduce the background of storage technology and summarize the current status and challenges of distributed storage. To address these challenges, we developed the Practical Distributed File System (PDFS). Compared with other distributed storage systems, the PDFS’ s self-proving algorithm mechanism could quickly achieve finality while guaranteeing the randomness and fairness of generating consensus group. Besides, the disaster recovery mechanism improves the security of data storage. Then we further evaluate the feasibility of PDFS and discussion the application prospects of PDFS. Finally, the paper summarizes the advantages and future challenges of PDFS.", "article_link": "https://doi.org/10.1145/3532640.3532645", "Authors": ["Hongfei Da", "Yan Zhou", "Pu Song", "Min Xiao", "Zhefu Feng", "Jiayin Qi"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "A Blockchain-Based Privacy-Preserving Scheme for Smart Grids", "date": "29 May 2020", "abstract": "The application of smart grids helps optimize electric dispatching and troubleshoot power interruption. Although it provides convenience to our lives, it also causes certain security risks. At present, open wireless sensor network is adopted in smart grids and is vulnerable to cyber attacks, resulting in network congestion and leakage of users' private information. Therefore, an attacker may infer users' identities, behavior and preferences by analyzing the real-time power consumption, which is an immediate threat to the users' privacy. To address this issue, we propose a privacy-preserving scheme based on blockchain and group signature to protect the privacy of users' identities while enhancing the security of power systems. On one hand, smart meters serve as nodes in the blockchain system and ensure data consistency through consensus mechanism. On the other hand, as group members, smart meters make sure of the anonymity of end-users by generating group signatures for power data. Security analysis shows that, our scheme achieves security in terms of privacy preserving, transaction verification and traceability, and is secure against common cyber attacks. In addition, the performance analysis shows that the proposed scheme is practical in the sense of consensus delay and throughput.", "article_link": "https://doi.org/10.1145/3390566.3391667", "Authors": ["Xin Chen", "Jiachen Shen", "Zhenfu Cao", "Xiaolei Dong"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "A Blockchain-based Flexible Traceability System for IoT Cards", "date": "20 July 2021", "abstract": "The real-name registration management of the Internet of Things (IoT) card is of great significance to the security development of the Internet of Things and the security construction of Cyberspace. However, IoT cards are decoupled from people in the circulation process, are often \"re-sold\", data sharing is difficult in cross-departmental circulation, and data quality is low. But the IoT card is the key for things to connect to the Cyberspace. The traceable management of the IoT card can ensure the identity analysis of Machines, Things, and People in the Cyberspace. This paper gives us a solution based on blockchain and secure terminals. With this solution, we can promote the data on the chain of each transaction chain effectively, improves the accuracy and effectiveness of the collected information, realizes the joint participation and system co-governance of different responsible entities, and improves the IoT card Real-name registration rate, the management ability to the network, etc. Experiments have fully proved the effectiveness, reliability, and advancement of the system, which has a massive role in accelerating the improvement of the comprehensive level of network security technology and helping the construction of a cyberspace integrity system.", "article_link": "https://doi.org/10.1145/3460537.3460542", "Authors": ["Meiyu Lin", "Haiting Han"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Blockchain-Enabled Trust Management in Service-Oriented Internet of Things: Opportunities and Challenges", "date": "20 July 2021", "abstract": "With the development of information and computer technology, internet of things (IoT) technology has brought tremendous changes to people's production and life. The emergence of IoT creates new opportunities to stimulate innovative services that better converge the information resources of IoT objects. However, due to the increasing scale of the network and the intelligence of devices, the development of the service-oriented IoT has also been accompanied by the issue of trust which is crucial to the security and stability of the system. Blockchain, as an emerging distributed ledger technology, is considered to be a driving force to improve the trust management of the service-oriented IoT. This research is a systematic analysis with the goal of illustrating and analyzing how the blockchain contributes to addressing the issue of trust management in service-oriented IoT. The objective of this paper is to understand the trust issue in the service-oriented IoT and analyze the potential blockchain-based solution, thereby motivating further research interest in this field.", "article_link": "https://doi.org/10.1145/3460537.3460544", "Authors": ["Lijun Wei", "Jing Wu", "Chengnian Long"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "A Patient-Centric Interoperable Framework for Health Information Exchange via Blockchain", "date": "20 March 2020", "abstract": "To design a blockchain-based framework for the cross-enterprise document sharing (XDS) and integration of electronic health records (EHR). In compliance with the integrated healthcare enterprise (IHE) profile, the XDS of EHRs were sent to the EHR cloud repository from each registered healthcare providers or by users themselves, and their link was shared and incorporated into a blockchain framework by using the same identifier for the same patient. In our proposed system, we used the link of XDS repository to hash the XDS EHR with SHA-256, which is a string of 64 HEX characters (32 bytes), and embossed it with a timestamp to indicate when the document was created or recorded in the blockchain. Then, the interested stakeholders verified the authenticity of the XDS EHR document by taking the hash of the document and matching it with the hash value stored in the Blockchain. A decentralized, non-tamperable, and encrypted storage framework was prototyped to enable the integration and sharing of XDS EHR. In this prototype, patient-centric EHR of different healthcare providers could be accessed in the blockchain dashboard of health records. The proposed blockchain framework provides a solution for the longitudinal storage of patient EHR and for sharing it in a secure and patient-centric way.", "article_link": "https://doi.org/10.1145/3376044.3376055", "Authors": ["Huiqun Wu", "Yujuan Shang", "Lei Wang", "Lili Shi", "Kui Jiang", "Jiancheng Dong"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "Smart Contract Development Model and the Future of Blockchain Technology", "date": "21 March 2021", "abstract": "Blockchain has become a mainstream technology in our society in recent years. With its nature of secure decentralization, people can create decentralized applications by developing smart contracts on top of a blockchain platform. With blockchain, technology is still in the developing phase, the smart contract development process in blockchain has its unique complexity and uncertainty. The condition will drive the challenge for any developers to work on this issue. In this research, we determine the smart contract development model in creating decentralized applications. Our proposed model aligned with our findings in the systematic mapping process of this study.", "article_link": "https://doi.org/10.1145/3446983.3446994", "Authors": ["Richard Richard", "Harjanto Prabowo", "Agung Trisetyarso", "Benfano Soewito"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450388962", "nombredePage": "80  pages"},
{"title": "A Blockchain-Enabled Society", "date": "02 July 2019", "abstract": "In this talk, I will cover the basic applications of blockchain, in particular for fintech, supply chain and food safety area. I will discuss the blockchain technology behind these applications and will further discuss the use cases in Australia.", "article_link": "https://doi.org/10.1145/3327960.3332396", "Authors": ["Joseph K. Liu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "keynote", "ISSN": "9781450367868", "nombredePage": "134  pages"},
{"title": "A Blockchain Based Land Registration and Ownership Management System for Bangladesh", "date": "25 February 2022", "abstract": "From the times of Satoshi Nakamoto's Bitcoins invention in 2008 Blockchain has become one of the most popular technologies to keep records secure, immutable, transparent and in distributed ledger. Blockchain is the underlining technology of Bitcoin. Blockchain technology has been used in many domains such as IoT, healthcare, education, business, Land management and so on. Among them Land Registration and Ownership Management is a very tough process all over the world. Land is a state immovable object and many frauds claim false ownership. It creates disputes among people. Also, many intermediaries are involved in this system. These intermediaries take huge amount of money to solve problems in time. For this reason, many people fail to achieve their own land. Blockchain technology has the all characteristics to solve these problems. It keeps data transparent, immutable and secure, at the same time it does not need any intermediaries. For the powerful characteristics of blockchain technology, the authors of this paper proposed a permissioned blockchain-Hyperledger based solution model to solve the problems of land registration and ownership management system. Here the authors present a system overview of the proposed system, a flowchart of working flow and an architecture. And last of all, some basic algorithms are also built to conduct a proper research.", "article_link": "https://doi.org/10.1145/3510487.3510501", "Authors": ["Roti Islam Shithy", "Nur Mohammad", "H.N.Ashiqur Ruhullah", "S M Yeamin Oni", "Md.Al Amin"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "Blockchain-based Security Governance Framework of Agricultural Product Traceability Data", "date": "29 October 2022", "abstract": "The traceability of agricultural products provides a means for modern management of agricultural product quality and safety. Due to factors such as diverse collection modes and poor sharing and exchange channels in the agricultural product traceability system, the traceability data faces problems such as data centralization, low data quality, and weak data security management and control. By introducing blockchain technology in the whole life cycle of agricultural product traceability data, a blockchain-based security governance framework of agricultural product traceability data is established, and preliminary implementation is carried out in Hyperledger Fabric, which provides thoughts and suggestions for security governance of agricultural product traceability data.", "article_link": "https://doi.org/10.1145/3559795.3559798", "Authors": ["Qi Meng"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450396622", "nombredePage": "143  pages"},
{"title": "On PeerCoin Proof of Stake for Blockchain Consensus", "date": "20 July 2021", "abstract": "Proof of Stake (PoS) has been talked about extensively as an alternative way of reaching consensus in blockchain systems. However, there are few publications on how PoS can be used to create new blocks in detail. The undisputed lead proponent for PoS is Ethereum. However, virtually all discussions regarding PoS for Ethereum are centered on selecting a block using PoS after one or more candidate blocks have already been somehow created. PeerCoin was the first blockchain system that incorporated PoS in block creation. Unfortunately, there is no known documentation on how PoS works in PeerCoin. In this paper, we fill this gap by presenting a detailed explanation of the PeerCoin PoS algorithm based on PeerCoin source code. We also dispel the misconception that PeerCoin PoS is based on Proof of Work (PoW) and hence would consume a lot of energy just like proof of work (PoW). In fact, it resembles PoW only on surface and differs from PoW substantially in terms of how to meet the difficulty target.", "article_link": "https://doi.org/10.1145/3460537.3460547", "Authors": ["Wenbing Zhao", "Shunkun Yang", "Xiong Luo", "Jiong Zhou"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "A Data Sharing Scheme Based on Blockchain System and Attribute-Based Encryption", "date": "20 July 2021", "abstract": "Blockchain systems offer a decentralized, immutable and transparent architecture that can give the ownership and control of data back to users, empower trusted and accountable data sharing. However, there still exist different scalability, security and potential privacy issues in blockchain networks, such as on-chain data privacy, data origin authentication, or compliance with privacy regulations (e.g. GDPR). To address these challenges, we propose a privacy-preserving and user-controlled architecture for data sharing based on blockchain system and Ciphertext-Policy Attribute-Based Encryption (CP-ABE), called ThemisABE. The proposed scheme has properties including one-to-many data encrypting and fined-grained access control. In the ThemisABE, any party can be an authority and the algorithm of CP-ABE generates the secret key corresponding to attributes for data user through any chosen set of nodes in blockchain system. Moreover, in order to realize accountability of CP-ABE algorithm and avoid performance bottleneck incurred by smart contracts, a kind of data structure of transactions is designed to record in the ledger, following an approaches to off-chain computations. The results of security analysis and experimental simulation show that the proposed scheme can solves the problems of privacy security and localization of data sharing. At the same time, the data sharing scheme has better performance and could be applied in some scenarios, such as eHealth, eGovernment or cross-border paperless trade.", "article_link": "https://doi.org/10.1145/3460537.3460559", "Authors": ["Xiaodong Zhang", "Taowei Chen", "Yan Feng", "Yimin Yu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Data Protection Method with Blockchain against Fabrication of Video by Surveillance Cameras", "date": "29 May 2020", "abstract": "In this paper, I propose a method for detecting violation of a regulation or an illegal action by surveillance cameras and for preventing fabrication of video records by the cameras. In this method, message digests of video records are signed and chained by blockchain for the integrity. There are some researches in which falsification of video is prevented by blockchain. However, in the researches, fabrication of the video is not considered. On the other hand, cameras are classified in terms of both reliability and security in my method for making trust chains of cameras against fabrication. In this paper, I also explain the condition for making the trust chains. A owner of a camera which shot violation of a regulation or an illegal action is rewarded with a fine for the violation or the penalty instead of bitcoin, and a signer of a chain is also rewarded. The proposed method can make areas safe with small cost and terminate false accusations by fabrication of video records.", "article_link": "https://doi.org/10.1145/3390566.3391685", "Authors": ["Ryuya Uda"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Facilitating Development of Higher Education Informatization Using Blockchain Technology", "date": "07 July 2022", "abstract": "The development of education informatization is crucial to improve the quality of higher education and promote the innovation of education, thus to cultivate innovative talents that meet the requirements of the modern information society. However, the current education informatization construction still faces problems such as insufficient top-level design, unconnected data sharing, and risks of privacy leakage. To this end, this article combines the emerging blockchain technology to discuss the positive function of blockchain in the establishment of education informatization, the possible opportunities for education informatization in the future, and some important challenges that will be faced. Specifically, from the perspective of higher education information system, we analyze the crucial issues in the current information system architecture including postgraduate training, teaching management, supervisor management, project information management, etc., and present the security and scalability issues of the system. On this basis, we propose the potential solutions based on blockchain and analyze the positive effects brought by blockchain technology in terms of security protection and data sharing. Finally, we summarize several major future issues that still need to be overcome in the convergence of blockchain and informatization of higher education.", "article_link": "https://doi.org/10.1145/3532640.3532658", "Authors": ["Lijun Wei", "Jing Wu", "Chengnian Long"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "A Differential-Privacy-Based Blockchain Architecture to Secure and Store Electronic Health Records", "date": "20 July 2021", "abstract": "As humanity enters the information age, the amount of digitized personal information grows daily. With growing connections between the digital and real-world, privacy information becomes more and more at risk, most especially information pertaining to one's electronic health records, or EHRs. The consequences of improper EHR security are shown in [12] and [13]. Innovations in security, namely Blockchain and differential privacy, provide data centers a powerful tool to combat would-be belligerents and secure patient data. We propose a novel blockchain architecture that utilizes the discrete M-band wavelet transform with Laplace-Sigmoid noise that allows connected centers to perform relevant research while also securing sensitive EHRs and protecting patient identities. We then simulate training machine learning models using our system and show that they perform with high accuracy.", "article_link": "https://doi.org/10.1145/3460537.3460555", "Authors": ["Avery W, Huang", "Adharsh Kandula", "Xiaodi Wang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "A Performance Measurement and Optimization Mechanism for Blockchain Mining Pool System", "date": "21 March 2021", "abstract": "Pooled mining is the de facto mining pattern in public, PoW (Proof of Work) based blockchain systems like Bitcoin and Ethereum. Mining pool aggregates discrete miners’ computation power to improve probability of getting the right block, and stabilize miners’ rewards. Miners reach consensus among pools, and maintain the whole blockchain network's stability. Due to architecture constrains across underlying transmission mechanism, computation power differences among nodes, and consensus algorithms, mining pools are facing increasing performance challenges, which lead to wastes of computing resources and loss of miners’ rewards. Based on analysis of mining pool architecture, this paper proposed a numerical model MENM (Miner Efficiency Numerical Model) to measure miner's computing efficiency, and a performance tuning mechanism DDCT (Dynamic Difficulty Calculation and Tuning) to dynamically adjust individual miner's difficulty in a pool based on MENM value, to improve mining pool's efficiency. The proposed tuning mechanism is also tested against a small experimental PoW mining pool to validate its effect.", "article_link": "https://doi.org/10.1145/3446983.3446991", "Authors": ["Xiaopeng Li", "Zhuo Li"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450388962", "nombredePage": "80  pages"},
{"title": "Efficient Authentication Processing for Spatial Keyword Queries in Hybrid Storage Blockchain", "date": "07 July 2022", "abstract": "Blockchain technology has emerged as a promising solution for secure data storage and retrieval for decentralized applications. To scale up the blockchain services, a common approach is to employ a hybrid storage architecture, where only meta-data are stored on-chain and the raw data are outsourced to an off-chain storage service provider. In this scenario, users need to query the data on-chain and off-chain at the same time, and the key issue for query processing would be how to design a gas-efficient authenticated data structure (ADS) to guarantee the completeness and soundness. In this paper, we study the spatial keyword authentication queries in the hybrid-storage blockchain, which includes on-chain and off-chain storage. We propose the GEMIR-tree index, which can significantly reduce the cost of maintenance by combing a single MIR-tree and a series of SMIR trees. Theoretical analysis and empirical evaluation are conducted to validate the performance of GEMIR-tree. Experimental results show that, compared to the baseline solution, the proposed GEMIR-tree index can efficiently reduce gas cost.", "article_link": "https://doi.org/10.1145/3532640.3532644", "Authors": ["Xu Wang", "Zhiwei Zhang", "Xiaochun Yang", "Guoren Wang", "Aoqian Zhang", "George Yuan"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "Prevention of Medication Loss through a Marketplace and Blockchain", "date": "20 March 2020", "abstract": "The emergence of a digital marketplace in the world and especially in Brazil around 2012 has innovated the way merchants and consumers use technology to commercialize products and services. Consumers are able to search for products and services from many merchants at once while merchants can reach consumers in many different platforms as well as creating a network of business and relationships between the two.", "article_link": "https://doi.org/10.1145/3376044.3376059", "Authors": ["José G. C. Neto", "Raphael C. Barbosa", "Fernando C. H. Marino", "Nicholas L. Zanutim"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "Design and Analysis of Blood Donation Model Based on Blockchain and KNN", "date": "02 October 2021", "abstract": "With the development of blood donation industry in China, the blood donation model has changed. Outdated blood donation management software can no longer meet the needs of the new era, so it is imperative to design and implement a blood donation platform based on the combination of blockchain and KNN(K-Nearest Neighbor).This system uses blockchain to store the key information of blood donation and Hash file information, uses IPFS to store the identity image and signature file of the real blood donor, and uses the KNN algorithm to match the nearest blood supply center with a specific blood type, in order to deploy timely when the hospital is ischemic and reduce the mortality caused by insufficient blood in the blood bank. This project combines traditional blood donation with blockchain and KNN. It can not only ensure the privacy and safety of blood donors, and trace the blood source, but also can match the nearest blood bank to call the hospital for ischemia, which will contribute to the public welfare undertakings of blood donation. I hope this project can provide a reference for the future blood donation business.", "article_link": "https://doi.org/10.1145/3475992.3475997", "Authors": ["Yaling Luo", "Gehao Lu", "Yiming Wu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389518", "nombredePage": "82  pages"},
{"title": "The Fit of Blockchain into Rural Area Financial Management Accountability in Indonesia", "date": "29 May 2020", "abstract": "It has been well recognized that traditional blockchains have limited throughput. It is intuitive to achieve higher throughput by increasing the block size and shorten the block interval. In this paper, we study the security implications on doing so, and define the boundary for acceptable block sizes and block intervals. We define the security of the blockchain in terms of the stale block rate in the network and carried out an empirical study using a blockchain simulator to find the optimal block parameters (size and interval). We show that it is possible to achieve sufficiently high throughput for a blockchain platform to be used for activities beyond cryptocurrency, such as state-level electronic voting.", "article_link": "https://doi.org/10.1145/3390566.3391677", "Authors": ["Dumaria Simanjuntak", "Retno Saraswati", "Reny Yemimalina Sinaga"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "When Secure Data Sharing Meets Blockchain: Overview, Challenges and Future Prospects", "date": "07 July 2022", "abstract": "Promoting data sharing to recreate greater value has been an important development trend in recent years. However, the drawbacks of centralized storage, data leakage risk, and the lack of trust mechanisms among entities exposed by traditional data sharing models have seriously reduced users' willingness to share data and hindered the maximization of data value. Blockchain technology, which has emerged and gradually popularized, provides new ideas for secure data sharing by virtue of its decentralization, traceability, trustlessness and programmability, but a series of problems such as compatibility, performance, security and privacy have also brought serious challenges to it. According to the research results in recent years, we conduct an overview of the layered technology architecture of blockchain-based secure data sharing model by particularly emphasizing on the distributed storage technology, data sharing mechanisms and associated cryptography algorithms. And we also expound the challenges faced by the current research as well as the prospect of future research directions.", "article_link": "https://doi.org/10.1145/3532640.3532641", "Authors": ["Yuhan Luo", "Mingzhe Liu", "Jianping Wang", "Cuixu Yuan", "Tong Liu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "Node Criticality Assessment in a Blockchain Network", "date": "10 November 2019", "abstract": "Blockchain systems are being rapidly integrated in various technologies, with limited work on the effect of the underlying network topology on the blockchain performance. In this work, we investigate the significance of each network node on the overall blockchain performance. This is assessed by selecting critical nodes according to different criticality metrics, and investigating, using simulations, the degradation in performance incurred upon removing these nodes. The most critical nodes are the ones that incur the greatest degradation in performance. The considered performance metrics are the blockchain size and the packet drop rate. Criticality metrics such as Betweennes Centrality, Closeness Centrality and Degree Centrality are compared. It is found that the Sign Change Spectral Partitioning approach, enhanced with Blockchain Specific traffic flow information, is able to identify critical nodes better in the sense that higher degradation in performance is reported upon their removal.", "article_link": "https://doi.org/10.1145/3362744.3363343", "Authors": ["Aditya Shyam Bazari", "Akash Aggarwal", "Waqar Asif", "Marios Lestas", "Muttukrishnan Rajarajan"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450370127", "nombredePage": "35  pages"},
{"title": "Achieve Fully Decentralized End to End Encryption Meeting via Blockchain", "date": "07 July 2022", "abstract": "Zoom Meeting is an enterprise online video conferencing solution with real-time messaging and content sharing. However, it's lack of privacy protection since centralized Zoom servers are capable of monitoring user's messages. Thereby, to solve the privacy problem, in May 2020, Zoom acquired Keybase so that Keybase's team can help it to build end-to-end encryption meeting while remaining Zoom's current scalability and high-performance. Nonetheless, according to the latest released Zoom's whitepaper, even with the new design of E2E(end to end) encryption meeting, the security threats can't be erased completely since the new design is not fully decentralized.", "article_link": "https://doi.org/10.1145/3532640.3532648", "Authors": ["Yang Tan"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "An Improved Consensus Mechanism for the Blockchain Based on Credit Rewards and Punishments", "date": "29 May 2020", "abstract": "In the traditional Proof of Stake (PoS), the share of the currency owned by the node, that is, the share of the equity, determines the probability that the node is selected as the representative node. In each round of the block generation, a node is selected as the creator of the next block by the verification, and the selected creator will pack appropriate transactions into the block and publish it on the blockchain. However, in the network with poor synchronization, the traditional PoS produces multiple verified representative nodes in each round, which generates multiple blocks. Then the blockchain is easy to produce the bifurcation. Aiming at the bifurcation problem of PoS, we propose an improved voting method based on credit rewards and punishments to vote on multiple blocks. The block is selected by considering the credibility of the creator, the count of the obtained comprehensive votes and the transaction value of the block. Thereby it can ensure the consistency and the fairness of the blockchain network. In the same time, the malicious node is found and voted to be removed in time by counting the number of invalid blocks generated by the nodes. It can ensure the security of the blockchain network.", "article_link": "https://doi.org/10.1145/3390566.3391668", "Authors": ["Lixiang Li", "Jin Yan", "Haipeng Peng", "Yixian Yang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Blockchain Privacy Protection Algorithm Based on Pedersen Commitment and Zero-knowledge Proof", "date": "25 February 2022", "abstract": "Due to the transparency of the blockchain, the data in the blockchain can be viewed by any joining node, and the privacy is weak. In order to better solve the problem of privacy protection in the current blockchain, for the application of e-commerce blockchain, the Pedersen commitment mechanism is adopted to hide the transaction amount, combined with zero-knowledge proof technology to realize the verification of the transaction amount. At the same time, an efficient range proof scheme based on polynomial commitment and vector inner-product commitment is used to verify whether the transaction amount and the balance of both parties are greater than zero. Finally, use the homomorphism promised by Pedersen to update the ciphertext ledger. The security analysis and efficiency test of the proposed blockchain privacy protection algorithm show that compared with the existing schemes, the proposed algorithm has the advantages of strong security and higher efficiency.", "article_link": "https://doi.org/10.1145/3510487.3510488", "Authors": ["Haifeng Wang", "Junguo Liao"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "A Hierarchical Trust Management Architecture Based on Blockchain for Crossover Service", "date": "29 May 2020", "abstract": "As an emerging business model of the modern service industry (MSI), crossover service integrates services from enterprises and organizations in different fields. By combining computer and communication technologies, crossover service can improve the efficiency and quality of services. However, due to the complexity and heterogeneity among different industries, there still remain huge challenges regarding the service convergence process. One of the most important issues is the trust management in crossover services. The establishment of trust is the basic requirement of service convergence. In this paper, we first present the overview of crossover service and the issue of trust management by analyzing the specific application case of crossover service. Besides, based on blockchain technology, we will propose a decentralized trust management architecture to address the trust management issue in crossover service. The introduction of blockchain will significantly enhance the security of the crossover service. Moreover, a complete trust delivery relationship among different objects will be presented for the proposed trust management architecture. Finally, the feasibility of our proposed trust management architecture and the future research challenges will be illustrated in detail.", "article_link": "https://doi.org/10.1145/3390566.3391663", "Authors": ["Lijun Wei", "Jing Wu", "Chengnian Long"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "A Design of Economic Mechanism for Business Development Based on Blockchain", "date": "15 March 2019", "abstract": "The innovative creation of cryptocurrency and Blockchain technology brings possibility for operating business in a decentralized community with reduced friction. But current business development on the blockchain platform is dragged by slow progress in technique, ill-designed economic mechanism, and difficult fund-raising procedure. Based on the analysis about major defects of Bitcoin's economic mechanism and the typical fund-raising methods in this field, we proposed a value-backed economic mechanism which has a clear separation of tokens' attributes as well as a reasonable distribution rule of profit. Rather than issuing a token with both utility and financing attributes at the very beginning, a utility token with a warrant attribute is introduced to stimulate and facilitate the value exchange between miners and other participants. After the business has become mature enough, token holders can redeem certain security tokens and start to enjoy dividends and other rights as a shareholder. In this way, speculation and fraud risks can be dramatically reduced, benefiting both project developers and investors.", "article_link": "https://doi.org/10.1145/3320154.3320159", "Authors": ["Yixin Cao", "Zhaoye Xu", "Xiaochuan Wu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450362689", "nombredePage": "84  pages"},
{"title": "Blockchain-based Services for Sharing Education Records in Industrial IoT Environment", "date": "25 February 2022", "abstract": "The path towards Industry 4.0 have pushed the workforce to continuously develop their skills to stay at the forefront of their careers and remain attractive to their employers. In this case, the electronic portfolio is designed as a promising tool for professionals and employers, in assessing and presenting guidance for further learning in the workplace environment. However, the implementation of electronic portfolios faces huge challenges, especially due to the lack of interoperability to collect and share competition evidence among multiple organizations and institutions. The growing trend of professional (learning) interoperability has brought other challenges that must be addressed in order to fully utilize the potential of the electronic product portfolio in the context of the fourth industry. This article proposes a framework taking the benefits of blockchain, decentralized storage systems, smart contracts and session management in achieving professional-centric interoperability while creating electronic portfolio and share evidences among multiple organizations without giving up the confidentiality, integrity and availability of shared evidence. The simulation of the proposed model for proof of concept on Ethereum proved its viability in real world practice. In expansion, the assessment of the proposed model proved its effectiveness in terms of cost, storage space and security as a possible solution in electronic portfolios implementation and assisting professionals to stay competitive in global labor market.", "article_link": "https://doi.org/10.1145/3510487.3510507", "Authors": ["Adel Binbusayyyis"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "Que Bian: An Electronic Medical Record Management System on Blockchain", "date": "21 March 2021", "abstract": "Medical Record Management System is an important information management system in healthcare centers and hospitals. Information kept in such systems need to be clean, correct and tamper-proof. In this paper, we take advantage of blockchains’ tamper-proof and decentralization properties to develop a robust and secure electronic medical record management system. In particular we choose HyperLedger Fabric as our underlying technical architecture. HyperLedger Fabric yields higher throughput and lower latency compared with other blockchains, which is a perfect candidate for enterprise software development. Our system is a novel innovation that can serve as an ideal replacement for conventional Medical Record Management System.", "article_link": "https://doi.org/10.1145/3446983.3446985", "Authors": ["Hao Wang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450388962", "nombredePage": "80  pages"},
{"title": "Research on Blockchain Financial Derivatives Cluster", "date": "21 March 2021", "abstract": "According to the National Internet Information Office's \"Domestic Blockchain Information Service Filing\", there had been 72 enterprises registered for providing blockchain-based financial services by the end of 2019, accounting for 17% of the total number, and 120 financial services had been filed. This data reflects the booming blockchain financial application, and the growing interest in blockchain finance. This paper uses qualitative analysis and scale method to analyze the blockchain financial derivatives cluster, based on the collection of 122 operating blockchain financial enterprises’ main businesses. The study finds that blockchain financial derivatives have advantages of mitigating information asymmetry and reducing transaction costs; compared with traditional finance, it also changes the form of transactions rather than the nature of finance (i.e. credit), and innovates related financial businesses focusing on credit and technology. The results of this paper provide an important reference for the business innovation transformation of traditional financial enterprises and investors' investment choices, and also suggests that the government should introduce relevant policies as soon as possible to regulate legal loopholes.", "article_link": "https://doi.org/10.1145/3446983.3446996", "Authors": ["Shurui Zhang", "Ji'an Tang", "Qiao Hu", "Feng Liu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450388962", "nombredePage": "80  pages"},
{"title": "Attribute-based Access Control of Data Sharing Based on Hyperledger Blockchain", "date": "29 May 2020", "abstract": "While public cloud service provides scholars a means to collaborate and share studies, depositing their data on a centralized semi-trusted cloud server managed by third party, raises security and privacy issues; secure decentralized storage can overcome this risky problem. In this paper, we propose an architecture model providing more fine-grained access control over the data stored in the cloud. Our proposed system is implemented by combining Hyperledger blockchain technology and Attribute-based Encryption (ABE) scheme to achieve this fine-grained access control of the shared files in decentralized environment. The implementation of the ABE prevents unauthorized users from accessing data and allows data owners to manage and control their data by encrypting shared data under an access control policy associated with a set of attributes. The Hyperledger blockchain assures the confidentiality and integrity of all stored files including key generation, policy assignment, and access request service. Our system prototype was implemented using chaincodes and tested on the Hyperledger Composer blockchain platform.", "article_link": "https://doi.org/10.1145/3390566.3391688", "Authors": ["Afnan Alniamy", "Bradley D. Taylor"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Practical Application and Evaluation of Atomic Swaps for Blockchain-based Recommender Systems", "date": "21 March 2021", "abstract": "Recommender Systems are very popular tools within the online community, suggesting to their users a big variety of items like products, videos, music and locations to visit. Moreover, users actively populate these systems sending and reading opinions under the form of reviews, and potentially obtaining a reward for their activities. However, such systems typically rely on a central authority that acts as a trusted party having total control over the system. Decentralized Recommender Systems have been proposed to solve such issue distributing the control and responsibility on the hands of their users, but leading to risks in case of disputes or misbehaviour. Based on a general architecture of a Decentralized Recommender System, in this paper we identify the potential unfair exchanges that may rise during the activity between two users, and we propose a solution based on the concept of atomic swaps inherited from the blockchain technology. Finally, we provide an attack model to show that the proposed solution creates fair processes.", "article_link": "https://doi.org/10.1145/3446983.3446993", "Authors": ["Andrea Lisi", "Andrea De Salve", "Paolo Mori", "Laura Ricci"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450388962", "nombredePage": "80  pages"},
{"title": "Research on the Application of Blockchain technology in Ubiquitous Power System Internet of Things", "date": "20 March 2020", "abstract": "In this paper, we describe the characteristics of blockchain technology, as well as the application framework of the Internet of Things and the application process of the power system internet of things. On this basis, we summarize the key technologies needed for ubiquitous power system Internet of Things. We analyzed the feasibility and necessity of the ubiquitous power system Internet of Things application blockchain technology. We propose a design scheme for the ubiquitous power system internet of things application blockchain system in a province.", "article_link": "https://doi.org/10.1145/3376044.3376065", "Authors": ["Zang Baozhi", "Yong Junyan", "Li Rongsheng", "Su Shanting"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "Proof-of-Concept (PoC) of Land Mortgaging Process in Blockchain-based Land Registration System of Thailand", "date": "29 May 2020", "abstract": "Land title deeds are important documents that can be used to verify ownership and transfer history of lands. In Thailand, the Department of Lands operates and facilitates the transfer of ownership and other operations related to lands. The current technology used in the operations often encounters problems with the reliability of operations and complexities that cause delays. This paper investigates a proof-of-concept (PoC) of the integration of blockchain in the land registration system to improve the reliability of storage and reduces the steps in the process. The process of loan contracts with banks is used in the PoC and an Ethereum-based private blockchain is developed and tested. Performance evaluation of our proposed system can handle at least 26 transactions per second over a range of a number of transactions of interest. The results show promising potential both in the reduction of process and the performance of blockchain for the proposed use case.", "article_link": "https://doi.org/10.1145/3390566.3391669", "Authors": ["Suporn Pongnumkul", "Chanop Khonnasee", "Swiss Lertpattanasak", "Chantri Polprasert"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "A Blockchain and SIFT Based System for Image Copyright Protection", "date": "20 March 2020", "abstract": "Internet technology has driven the dissemination revolution of images, but also makes the illegal reproduction and unauthorized use of images extremely rampant. At present, the registration of digital copyright of images should be authorized by authoritative management agencies. There are many problems, such as long audit cycle, no substantive review, difficulty in proof, high cost, centralized storage and so on. Based on blockchain technology and SIFT local feature extraction algorithm, this paper studies and implements a new generation of image digital copyright system. SIFT algorithm is used to extract the invariant features of image such as angle of view, brightness and rotation, etc. which will constitute the local feature vector set of the image, and these local feature vector sets are regarded as the only copyright basis of the image. Even if the image is modified by scaling, rotation and brightness, local features can still be extracted correctly, which can effectively prevent copyright registration of infringing images; Furthermore, IPFS (Inter-Planetary File System) was utilized for distributed storage of images' copyright features; Finally, Hyperledger Fabric and smart contract (chaincode) are used to realize copyright registration, copyright transfer and other functions. The experimental results show that the system has the advantages of automatic similar infringement detection, decentralized storage, tamper-proof and traceability.", "article_link": "https://doi.org/10.1145/3376044.3376051", "Authors": ["Jianfeng Shi", "Dian Yi", "Jian Kuang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "Runtime Hook on Blockchain and Smart Contract Systems", "date": "07 October 2020", "abstract": "Using hard-fork mechanism on the blockchain to recover the losses caused by attacks contradicts the immutable characteristic of a blockchain system. To prevent malicious transactions from getting into blockchains in advance, we propose a runtime hook technique to synchronize and analyze the ongoing transactions exposed to the Ethereum transaction pool. Having a complete view of the past and the ongoing transactions, we can identify and enforce abortion of malicious transactions and prevent losses due to attacks being executed and recorded in the blockchain. Specifically, we modify the Ethereum source code to instrument the entry point of a node to synchronize data received from the Ethereum P2P network and systematically scan suspicious patterns in transactions to identify potential attacks. As a proof-of-the-concept, we show how to deploy the proposed runtime hook system on a private blockchain system, such that we can detect and prevent transactions of double spending on the 51% attack and reentrancy attack of smart contracts.", "article_link": "https://doi.org/10.1145/3384942.3406870", "Authors": ["Wei-Ting Lin", "Shun-Wen Hsiao", "Fang Yu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450376099", "nombredePage": "34  pages"},
{"title": "Blockchain as a Dissipative System and Cognitive Space", "date": "06 October 2020", "abstract": "This paper proposes a fundamental theory to understand and explain blockchain based on dissipative structure theory and cognitive science. Propose that blockchain is a dissipative system that is an ordered state far from equilibrium, constantly exchanging various entropy with cyberspace, physics, and society. Provide a formalized cognitive space framework to bridge the gap between the cyber, physical, and social world. Analyze the dissipative structure characteristics of blockchain systems such as openness, far from equilibrium, mutation, fluctuation, and composed of lots of primitive units. Propose and explain that blockchain will be the carrier of the global cyber-physical-social system's common shared cognitive space.", "article_link": "https://doi.org/10.1145/3384943.3409440", "Authors": ["Kuan Li", "Chenglie Du", "Zhenguo Li"], "Publisher": "Association for Computing Machinery", "Qualifiers": "poster", "ISSN": "9781450376105", "nombredePage": "223  pages"},
{"title": "Preliminary steps towards modeling blockchain oriented software", "date": "27 May 2018", "abstract": "Even though blockchain is mostly popular for its cryptocurrency, smart contracts have become a very prominent blockchain application. Smart contracts are like classes that can be called by client applications outside the blockchain. Therefore it is possible to develop blockchain-oriented software (BOS) that implements part of the business logic in the blockchain by using smart contracts. Currently, there is no design standard to model BOS. Since modeling is an important part of designing a software, developers may struggle to plan their BOS. In this paper, we show three complementary modeling approaches based on well-known software engineering models and apply them to a BOS example. Our goal is to start the discussion on specialized blockchain modeling notations.", "article_link": "https://doi.org/10.1145/3194113.3194123", "Authors": ["Henrique Rocha", "Stéphane Ducasse"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450357265", "nombredePage": "70  pages"},
{"title": "A Strategy for Mitigating Denial of Service Attacks on Nodes with Delegate Account of Lisk Blockchain", "date": "29 May 2020", "abstract": "In this paper, I evaluate a type of denial of service attack, bandwidth depletion, that difficult the block propagation in blockchain networks. Towards the end, I study the attack on Lisk blockchain and explore its effects in the Delegated Proof of Stake consensus. I also propose a methodology joint with two tools I've created as countermeasures against such type of attack. The methodology is composed of the configuration of the same delegate account in more than one node joint with the use of created tools capable to detect the percentage of consensus on each monitored node and activate block forging status in a single node dynamically. Therefore, allowing a block to be forged even when the delegate account is under attack on another node and reducing the chance of forks creation on the blockchain with the same delegate account configured and activated on two or more nodes in the same forging time slot.", "article_link": "https://doi.org/10.1145/3390566.3391684", "Authors": ["Davi Alves"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Secure Hierarchical Processing and Logging of Sensing Data and IoT Events with Blockchain", "date": "29 May 2020", "abstract": "Recently, we have seen increasing popularity of using the blockchain technology to secure sensing data generated by traditional wireless sensor networks and Internet of Things (IoT). One of the biggest obstacles for integrating the IoT and blockchain technologies is the limited throughput of the current distributed ledgers. In this paper, we propose a novel method for hierarchical processing and logging of potentially large amount of sensing data with the blockchain technology, which could drastically address the issue of limited throughput in blockchains. Depending on the scale of the sensing need, two or more levels of processing and logging could be involved, where only the highest level of summative sensor data are placed on the blockchain or a secure distributed ledger. By establishing a strong linkage between different level of data, all lower-level and raw data are also made immutable once the highest level of summative data are placed on the blockchain.", "article_link": "https://doi.org/10.1145/3390566.3391672", "Authors": ["Wenbing Zhao", "Shunkun Yang", "Xiong Luo"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Design of Transaction System for Remote Sensing Cloud Service based on Blockchain", "date": "20 March 2020", "abstract": "With the development of RS (Remote Sensing) technology and RS application, RS industry is faced with opportunities and challenges in expanding the application fields. There is a high maintenance costs, time-consuming, low transaction processing efficiency, user privacy leaks and so on in the traditional centralized RSCS (Remote Sensing Cloud Services) trading mode. Meanwhile, it can't adapt to high-frequency and real-time trading scenario. In order to realize efficient, fair and transparent trade and protect the privacy of users, this paper proposed transaction system mode for RSCS based on blockchain. The user may call or produce the same task multiple times in the traditional transaction process. In this case, the system allocates and recycles resources frequently. It has caused unnecessary overhead and wasted the time of user. Therefore, we proposed AS (Algorithm Service) transaction mode combine smart contract. We can achieve decentralized P2P trade among through smart contract. The AS can reduce user's repetitive work, improve the efficiency of transaction processing, and improve user experience.", "article_link": "https://doi.org/10.1145/3376044.3376056", "Authors": ["Yang Lu", "Xueheng Wang", "Renle Wei", "Yihua Gao", "Zhenyue Huang", "Yi Xie"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377430", "nombredePage": "135  pages"},
{"title": "Authentic Facts: A Blockchain Based Solution for Reducing Fake News in Social Media", "date": "25 February 2022", "abstract": "Now a days, people spend most of their times in social media. Due to availability of news and also for the free scope of sharing, most of the time rumors are being extensive in a short period of time. Detecting and preventing rumors and false information remains a significant challenge for social network. The introduction of blockchain technology has paved the way for the development of decentralized apps in order to address this issue. In this technology any information is recorded permanently. We will explore a strategy to eliminate bogus news on social media by utilizing the benefits of peer-to-peer network ideas. By issuing non-fungible token content rating we can detect and ensure appropriate news. The findings revealed that the suggested technique has a satisfactory performance and efficiency in recognizing rumors and preventing their spread.", "article_link": "https://doi.org/10.1145/3510487.3510505", "Authors": ["Imran Ush Shahid", "Md.Tanbir Anjum", "Md.Shafayet Hossain Miah Shohan", "Rahanuma Tasnim", "Md. Al-Amin"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "Blockchain-based Automatic Indemnification Mechanism Based on Proof of Violation for Cloud Storage Services", "date": "29 May 2020", "abstract": "In this paper we propose a blockchain-based automatic indemnification mechanism. Clients and service providers (SPs) exchange signed messages according to a predefined protocol that enables clients to utilize service-provider services with simultaneous cryptographic proof of service. When a client has discovered an SP to have violated a service level agreement based on cryptographic proof, then they can obtain cryptocurrency as a compensation by raising objections to a smart contract on a public blockchain. When an objection has been judged successful by programs located in the smart contract, a portion of the deposit (cryptocurrency in the smart contract) will be transferred to the account of the objection-raiser. In this way, the need to establish and run a customer service center with employees for processing such claims and refunds is obviated. Moreover, the traditional third-party trust is no longer needed. Focusing on services for cloud-storage service, we propose protocols and implementation of an indemnification system in the Ethereum. The feasibility of the proposed application has been demonstrated through pilot implementation and testing.", "article_link": "https://doi.org/10.1145/3390566.3391661", "Authors": ["Gwan-Hwan Hwang", "Pei-Chun Tien", "Yi-Hsiang Tang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Blockchain Based Transaction Management System for IC Industry", "date": "20 July 2021", "abstract": "With the development of Internet technology, all walks of life are undergoing industrial revolution and upgrading. Nowadays, many transactions in the integrated circuit (IC) industry chain have moved from offline to online, most of which are completed through trusted third-party platforms as the transaction medium. This transaction model, which relies on centralized institutions, is vulnerable to malicious cyberattacks, poses a risk of core technology theft for technology-intensive industries, and lacks the ability to trace the trajectory of transactions. To solve the above problems, this paper proposes a consortium chain-based transaction management system for the IC industry chain based on the transaction characteristics of commodities in the IC industry chain, designs an improved Raft consensus mechanism based on stability, credibility and contribution factors, a Prometheus-based data monitoring mechanism, and a set of smart contracts for on-chain transactions, implements a prototype system and tests its performance. The results show that the system can solve the above problems well and has high credibility and stability.", "article_link": "https://doi.org/10.1145/3460537.3460539", "Authors": ["Lei Pan", "Yue Wu", "Min Zhou", "Faxin Yu", "Zheming Lu", "Hua Chen"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "A Blockchain-based Trading Matching Scheme in Energy Internet", "date": "06 October 2020", "abstract": "With the advent of the Industry 4.0 era, the energy industry system revolution will also face new challenges. Against the backdrop of the global energy crisis, renewable energy has received great attention from countries around the world. Due to the characteristics of geographical dispersion, randomness, volatility and uncontrollability of renewable energy, the centralized traditional electrical energy networks cannot meet the management requirements of large-scale access to renewable energy. The emergence of the energy internet has enabled the effective use of renewable energy. As a distributed trading and data management technology, blockchain solves the problem of distributed electrical energy trading in the energy Internet. However, the distributed energy trading based on blockchain cannot satisfy the rational matching of trading objects. Therefore, we propose a blockchain-based electrical energy trading system BC-TMS Blockchain-based trading matching system, which can reasonably match trading objects according to the user's personalized needs and maximize the benefits of both parties to the trading. At the same time, the system also provides a certain degree of privacy protection. Finally, through security and application prospect analysis, we prove the usability and practicability of our proposed scheme.", "article_link": "https://doi.org/10.1145/3384943.3409430", "Authors": ["Xin Lu", "Zhitao Guan"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450376105", "nombredePage": "223  pages"},
{"title": "Simulating Difficulty Adjustment in Blockchain with SimBlock", "date": "06 October 2020", "abstract": "A blockchain is a gradually increasing list of \"blocks\" containing information that are linked together using cryptographic hashes. It is a distributed, decentralized, and public digital ledger technology. Blockchains have caught not only the attention of researchers but also industries that are interested in implementing blockchains into existing products and services. However, performing studies on actual blockchain networks remain challenging as they may involve many nodes or these nodes could be placed in different geographical regions. Simulators for Proof-of-Work blockchain exists to facilitate this, but features such as difficulty adjustment or dynamic hash rate are not available. Using SimBlock, a blockchain network simulator as a base, difficulty adjustment algorithm and the capacity to increase or decrease hash rate dynamically were added to the simulator and the efficacy of the implementation was investigated for two scenarios; fixed hash rate and increasing hash rate periodically, over the length of the simulations. Based on the experiments, higher precision in terms of the average of actual time taken to mine a block were obtained, with a deviation of 0.68% compared to 5.73% in original SimBlock, and a deviation of 7.10% compared to 10.91% in original SimBlock, for fixed hash rate and dynamic hash rate adjustment respectively. Further studies were conducted for data from 2019 where the proposed implementation resulted in less than half the deviation achieved by the original implementation of SimBlock.", "article_link": "https://doi.org/10.1145/3384943.3409437", "Authors": ["Zi Hau Chin", "Timothy Tzen Vun Yap", "Ian K. T. Tan"], "Publisher": "Association for Computing Machinery", "Qualifiers": "short-paper", "ISSN": "9781450376105", "nombredePage": "223  pages"},
{"title": "Hunion Traceability: A New Type of Blockchain Traceability System Based on SM2, SM3 and SM4", "date": "25 February 2022", "abstract": "Data traceability with the great serviceability has been widely used in various scenarios. However, the existing traceability mechanism often applies internationally accepted cryptographic algorithms such as MD5 and RSA in the data transmission process. These algorithms have been confirmed to have certain loopholes in security. This paper proposes a traceability system based on SM2, SM3, and SM4 algorithms. We establish a certificate issuance verification mechanism to improve the data transmission security performance of the traceability system based on SM2 and SM3. At the same time, the system uses the SM4 algorithm to design a blockchain interaction scheme using data digest, and uses homomorphic encryption to verify the correctness of the data. In addition, we also replaced the SM2 in the system with the RSA, and the SM3 with the MD5 to test the pros and cons of the two different algorithm systems in terms of security performance and execution efficiency. The test results show that the traceability mechanism based on SM2, SM3, and SM4 performs 1-2 seconds faster than the traceability mechanism based on RSA and MD5 in terms of average transaction response time. At the same time, SM2, SM3, and SM4 also have better security performance.", "article_link": "https://doi.org/10.1145/3510487.3510503", "Authors": ["Shenhui Zhang", "Hao Meng", "Xiulai Li", "Weiwei Liu", "Bernie Liu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "A Design of Key Distribution Mechanism in Decentralized Digital Rights Management Based on Blockchain and Zero-Knowledge Proof", "date": "20 July 2021", "abstract": "Digital Rights Management (DRM) is a basic requirement in the Internet era. In order to solve the disadvantages caused by centralization in traditional DRM, many decentralized DRM (DDRM) structure are proposed, and they have achieved decentralization in copyright registration, copyright trading, etc. However, the distribution of content keys is their bottleneck. Different from public copyright and transaction information, content key which is used for digital content decryption cannot be directly disclosed to decentralized nodes. The existing DDRM relies on specific nodes or an ideal trust environment to issue encrypted content keys, which makes the system unable to be completely decentralized. In this paper, we proposed a decentralized key distribution system, and it can be compatible with the existing DDRM structure. We use zero-knowledge proof technology to prove to others the correctness of the encrypted content key without revealing it. We use blockchain technology to achieve decentralized key distribution, without relying on any trusted center. Our system allows consumers and agents to apply for and distribute content keys without trusting each other. Malicious users cannot commit fraud against others, and damaged nodes will not affect the stability and reliability of the system.", "article_link": "https://doi.org/10.1145/3460537.3460556", "Authors": ["Zihang Cao", "Li Zhao"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Blockchain based Big Data Platform of City Brain", "date": "20 July 2021", "abstract": "Blockchain technology, with its distributed ledger, decentralization, high security, no tampering and other features, helps to solve the problems of data source confirmation, traceability and authorized data sharing. The effective utilization of data to achieve automatic governance and trusted decision-making of the city is known as \"City Brain\". The city brain is the key in smart city development, while the key to build a city brain is data resources. Aiming at the challenges existing in the construction of big data platform, this paper proposes a new solution based on blockchain, establishes the entity model and data model, analyzes the business model, designs the blockchain data platform framework and the cloud-blockchain integrated operation mode, and at last discusses the issues concerned in the application.", "article_link": "https://doi.org/10.1145/3460537.3460561", "Authors": ["Yu Liu", "Junfang Zeng"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "How much blockchain do you need?: towards a concept for building hybrid DApp architectures", "date": "27 May 2018", "abstract": "Adding blockchain technology to existing systems instead of building them from the ground up poses several challenges. It is difficult to find out which attributes of blockchains are important for a given use case (e.g. immutable, trustless, anonymous) and to decide which elements of an architecture should employ blockchain technologies. Current approaches generally only give a hint on whether blockchain technology makes sense for a given use case or not. This paper proposes a more fine-grained approach to decide which elements of an application architecture could benefit from the use of blockchain technology. We illustrate the first outline of our approach which identifies participants, their trust relations and interactions to derive a hybrid architecture (i.e., an architecture embedding blockchain technology in existing software systems or creating new systems using blockchain only in certain parts).", "article_link": "https://doi.org/10.1145/3194113.3194121", "Authors": ["Florian Wessling", "Christopher Ehmke", "Marc Hesenius", "Volker Gruhn"], "Publisher": "Association for Computing Machinery", "Qualifiers": "short-paper", "ISSN": "9781450357265", "nombredePage": "70  pages"},
{"title": "Factors that Impact Blockchain Scalability", "date": "10 January 2020", "abstract": "Blockchain systems (more precisely Distributed Ledger Technologies (DLTs)) represent a different digital ecosystem compared with traditional computer systems. One major difference are the performance and scalability factors which will be discussed and analytically investigated in this paper. In doing so, we provide guidance for defining a research agenda focusing on the investigation of the crucial role of scalability for blockchain systems. System performance -- measured in terms of (1) consensus response time (blockchain network latency or time to convergence/agreement); (2) number of transactions per second or throughput, and (3) computing (and power) resources consumed -- can be understood by considering the design dimensions of a blockchain system, namely: (i) the type of blockchain system needed from a requirements perspective which in turn determines; (ii) the complexity of the consensus protocol used; (iii) the topography of the traffic flow on the network; (iv) the performance and complexity of the domain-specific language that implements smart contracts; and (v) by the anticipated growth in size and complexity of the distributed ledger itself.", "article_link": "https://doi.org/10.1145/3297662.3365818", "Authors": ["Peter W. Eklund", "Roman Beck"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450362382", "nombredePage": "350  pages"},
{"title": "Document Management System using Blockchain and Inter Planetary File System", "date": "06 October 2020", "abstract": "Blockchain Technology has been evolving from being a secure and immutable ledger of transactions for cryptocurrencies to a programmable interactive environment for building distributed reliable applications. This system proposes a secure platform to facilitate trustworthy document verification and management using Blockchain and Interplanetary File System (IPFS) to store data in the distributed and decentralized environment which is persistent and does not have any file size constraints. IPFS system provides a unique hash of the document based on the content of the document. The system uses smart contracts to record all the hashes for all the documents stored in the IPFS system. The system can efficiently and securely capture, manage and validate documents and prevent any malicious modification to the data.", "article_link": "https://doi.org/10.1145/3384943.3409443", "Authors": ["Mohit Vashistha", "Ferdous Ahmed Barbhuiya"], "Publisher": "Association for Computing Machinery", "Qualifiers": "poster", "ISSN": "9781450376105", "nombredePage": "223  pages"},
{"title": "Application Prospect of Blockchain in Renewable Energy Certificates", "date": "20 October 2020", "abstract": "Disadvantages like cumbersome verification and data centralization are involved in the application and transaction process of Renewable Energy Certificates in China. We realize that blockchain technology has been successfully applied in many fields with its features of decentralization, immutability, and traceability. As a result, we in this article aim to introduce blockchain into the current Renewable Energy Certificates trading system to solve the above problems. Firstly, this article gives an overview of blockchain technology, including its architecture and technical advantages. Secondly, it describes China's Renewable Energy Certificates transaction process and analyzes the potential challenges faced by it. Finally, it proposes a Renewable Energy Certificates trading system based on blockchain technology and analyzes its operation mode, advantages, and potential problems.", "article_link": "https://doi.org/10.1145/3424978.3425016", "Authors": ["Shengnan Zhang", "Jiaxing Xuan", "Zitong Lyu", "Yuchen Fu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377720", "nombredePage": "1038  pages"},
{"title": "Application and research of Carbon Asset Management Based on blockchain", "date": "31 December 2021", "abstract": "With the accelerated implementation of my country's carbon emission quota system and the continuous deepening of the national carbon market, more and more companies will participate in carbon asset management. Improving the level of intelligence in carbon asset management, reducing the cost of participating entities in the carbon market, and simplifying the carbon asset management process can effectively stimulate market vitality and innovate carbon market business models. Firstly, introduce the nature and necessity of carbon asset management, point out the basic process of carbon asset management, and analyze the current challenges facing my country's carbon asset management. Secondly, it introduces the technical characteristics and application status of blockchain, combined with the needs of carbon asset management, and proposes the application concept of carbon asset management based on blockchain. Then, it systematically elaborates the application design of blockchain technology in the whole process of carbon asset management, designing carbon asset data deposit certificates based on blockchain technology, carbon market entity identity authentication management, and application of smart contract transactions from the three aspects of architecture, and carbon emission traceability management, And carbon emission traceability management. Finally, a prospect is put forward for the future development of the blockchain carbon asset management application market that supports small, medium and micro enterprises as the main body.", "article_link": "https://doi.org/10.1145/3501409.3501530", "Authors": ["Guomin Li", "Jiangtao Li", "Lili-Li"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450384322", "nombredePage": "1723  pages"},
{"title": "On Design of Blockchain-based Transport Scheme", "date": "06 October 2020", "abstract": "Block chain is a revolutionary new technology proposed in recent years. It has the characteristics of decentralization, non-tampering with transactions, and extremely low transaction costs. These characteristics coincide with the decentralization and market structure of distributed transportation system. In this paper, we give the concrete structure of a blockchain-based transportation scheme, including process of journalizing, registration, transaction process. In addition, the correctness and security analysis of the scheme are also given in this paper.", "article_link": "https://doi.org/10.1145/3384943.3409444", "Authors": ["Yan Ren", "Qiuxia Zhao", "Haipeng Guan", "Zhiqiang Lin"], "Publisher": "Association for Computing Machinery", "Qualifiers": "poster", "ISSN": "9781450376105", "nombredePage": "223  pages"},
{"title": "Secure and Privacy-Preserving Data Computing Scheme Based on Blockchain for Double-Loop Governance of Smart Society", "date": "21 March 2021", "abstract": "Society governance nowadays has reached a new level after cutting-edge technologies such as artificial intelligence applied to every field of society. This progress requires a novel data sharing and computation mechanism among different parties as a foundation of society governance. In this paper, we introduce a new typical society governance pattern that has been emerging in the most modern cities in the world. With the involvement of smart decision-making units that change the interaction among objects in the governing process, we name the new pattern as “double-loop governing”. And to meet the higher requirement of data security and privacy protection in the process of new society governing way, we proposed a multi-party data computation and sharing scheme based on blockchain which can guarantee that every participator in the process of society governance can efficiently conduct computation based on diverse resources of data while the ownership of data can be ensured. Moreover, we introduce the architecture and the computation mechanism of the proposed scheme.", "article_link": "https://doi.org/10.1145/3446983.3446995", "Authors": ["Yujiao Hou", "Mengxiao Luo", "Yutong Liu", "Ning Wang", "Jinjin Zhang", "Weisheng Xu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450388962", "nombredePage": "80  pages"},
{"title": "Unraveling Blockchain based Crypto-currency System Supporting Oblivious Transactions: a Formalized Approach", "date": "02 April 2017", "abstract": "User privacy is an important issue in a blockchain based transaction system. Bitcoin, being one of the most widely used blockchain based transaction system, fails to provide enough protection on users' privacy. Many subsequent studies focus on establishing a system that hides the linkage between the identities (pseudonyms) of users and the transactions they carry out in order to provide a high level of anonymity. Examples include Zerocoin, Zerocash and so on. It thus becomes an interesting question whether such new transaction systems do provide enough protection on users' privacy. In this paper, we propose a novel and effective approach for de-anonymizing these transaction systems by leveraging information in the system that is not directly related, including the number of transactions made by each identity and time stamp of sending and receiving. Combining probability studies with optimization tools, we establish a model which allows us to determine, among all possible ways of linking between transactions and identities, the one that is most likely to be true. Subsequent transaction graph analysis could then be carried out, leading to the de-anonymization of the system. To solve the model, we provide exact algorithms based on mixed integer linear programming. Our research also establishes interesting relationships between the de-anonymization problem and other problems studied in the literature of theoretical computer science, e.g., the graph matching problem and scheduling problem.", "article_link": "https://doi.org/10.1145/3055518.3055528", "Authors": ["Lin Chen", "Lei Xu", "Nolan Shah", "Nour Diallo", "Zhimin Gao", "Yang Lu", "Weidong Shi"], "Publisher": "Association for Computing Machinery", "Qualifiers": "short-paper", "ISSN": "9781450349741", "nombredePage": "48  pages"},
{"title": "Blockchain-based Secure Medical Data Management and Disease Prediction", "date": "30 May 2022", "abstract": "Healthcare systems based on the Internet of Things have an increasing demand for health sensing technology. To manage the data collected and sampled by medical devices, traditional centralized data management will lead to attacks such as single point of failure, which pose a security threat. Aiming at the problems of low data trust and uncontrolled data sharing in telemedicine, we proposed blockchain-based secure medical data management and disease prediction. To securely manage healthcare data, we carefully designed three-tier architecture. Specifically, in the user sensor layer, medical sensors monitor the patient status in real-time. In the storage layer, to protect the privacy of patients, we stored their data in blocks and quantified the medical data by using information entropy technology. In addition, in the blockchain layer, we also used smart contracts for application, authorization, and access control of health data to eliminate privacy leaks caused by internal and external security risks. The information summary is recorded on the blockchain to ensure the integrity of backtracking and anti-repudiation. We designed an extensible machine learning algorithm to predict disease types using a disease prediction model algorithm based on transfer learning. Security analysis and numerical results showed that the proposed scheme can effectively manage the safety data of telemedicine and predict the patient's future condition.", "article_link": "https://doi.org/10.1145/3494106.3528678", "Authors": ["Meiquan Wang", "Huiru Zhang", "Haoyang Wu", "Guangshun Li", "Keke Gai"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450391757", "nombredePage": "153  pages"},
{"title": "Security Control Components for Epidemic Prevention Donation Management Blockchain", "date": "06 October 2020", "abstract": "After the outbreak of the new coronavirus pneumonia, it has been broadcasting soon. Medical supplies are out of used. Chinese people have provided medical supplies and raised donations to help Hubei Province, China. While, Red Cross Society of Hubei Branch and Wuhan Branch were suspected for unfair distribution of donated materials, the backlog of donated items, and inefficient assignment. These problems exposed public welfare organizations to the public sights. For information sharing, Jiangsu Province developed a new COVID-19 Donation Management Blockchain System (CDMBS). The system improves the transparency and credibility of donation information with the blockchain. Based on the overall architecture of Jiangsu's new coronavirus charity donation management blockchain, this paper designs various types of security control components. The components include the middleware for secure connection to protect the user certificate security. We designed CA certificate user management middleware to realize more secure registration and query functions for users with extended attributes. There is also a blockchain query middle with access control Software to ensure that important blockchain information is viewed securely. Experiments have verified the effectiveness and applicability of these security control components. It can be applied into a variety of scenarios in the CDMBS.", "article_link": "https://doi.org/10.1145/3384943.3409424", "Authors": ["Shuo Wang", "Qianmu Li", "Jun Hou", "Jian Jiang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450376105", "nombredePage": "223  pages"},
{"title": "CloudArcade: A Blockchain Empowered Cloud Gaming System", "date": "06 October 2020", "abstract": "By rendering game scenes on the remote cloud and delivering real-time video to end devices via the Internet, cloud gaming enables players to access game services anytime anywhere despite the hardware capacity of their terminals. However, as a commercial service, the state-of-the-art payment models for cloud gaming are still in their preliminary stages. In this paper, we reveal the shortages of existing cloud gaming pricing models and propose CloudArcade, a token-based cloud gaming system that employs blockchain-empowered cryptocurrency as a payment method for the players using the cloud gaming services. By using cryptocurrency, CloudArcade provides a transparent and resource-aware pricing method, it also enables a time irrelevant silent payment on the floating price to protects users' payment. These features eliminate the quality of experience degradation caused by the spot price in the traditional dynamic pricing model on the QoE-aware service pricing. We also employ the payment channel in CloudArcade to improve the system performance. Discussions on service pricing criteria are put forward, open issues about token issuing and malicious resource speculation are also reviewed. We believe the design of CloudArcade can show a good generality on other QoE-aware and human-centered applications.", "article_link": "https://doi.org/10.1145/3384943.3409420", "Authors": ["Juntao Zhao", "Yuanfang Chi", "Zehua Wang", "Victor C.M. Leung", "Wei Cai"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450376105", "nombredePage": "223  pages"},
{"title": "The Data Sharing Scheme based on Blockchain", "date": "06 October 2020", "abstract": "Data sharing is a vital method for data intensive and cooperative work-based applications. A central database system, which collects and stores data generated from different parties and provides open access, can not only save costs on infrastructures, but also provide consistent and uptodate data for all the participants. However, privacy and security issues also emerge especially when the shared data is highly sensitive, such as electronic medical records (EMRs). In this paper, we propose a new data sharing scheme with access control based on CP-ABE, searchable encryption, and blockchain. We realize two main goals in our scheme. First, data owners can share their data with multiple users who satisfy the access policy rather than just a single user. Second, the difficulty of the ciphertext query is overcome by means of searchable encryption technology. Most importantly, data owners do not need to interact with the data querier in the process of sharing. Both theoretical analysis and practical experiments show that the proposed scheme is secure and efficient.", "article_link": "https://doi.org/10.1145/3384943.3409426", "Authors": ["Xu Ma", "Chen Wang", "Laihua Wang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450376105", "nombredePage": "223  pages"},
{"title": "Conceptualizing Blockchain based Energy Market for Self Sustainable Community", "date": "10 November 2019", "abstract": "With a spectacular boom in blockchain technologies at various verticals and with the increase in renewable energy penetration, these could solve one of the major issues in Power Systems - Energy Demand Management by the utilities. Blockchain being a distributed architecture, it could fit into the deregulated energy market to enable energy trading in a self sustainable energy community and manage the power demands among the community members. As proof of concept, the blockchain technology is introduced in a smart community where consumers take part in energy trading among themselves as well as with the utility. In this paper, three use cases for P2P energy trading in a private blockchain network is discussed. The blockchain architecture is developed using the Hyperledger framework and the smart contracts are defined in the chaincode. The performance of the blockchain network on resource constrained IoT system based on Raspberry Pi is also evaluated.", "article_link": "https://doi.org/10.1145/3362744.3363345", "Authors": ["A. Nidhin Mahesh", "N. B. Sai Shibu", "S. Balamurugan"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450370127", "nombredePage": "35  pages"},
{"title": "Can the Issue of Invoice Reimbursement in China be Solved Completely through the Integration of Blockchain and IoT Technology?", "date": "29 May 2020", "abstract": "In order to achieve the automatic and non-inductive reimbursement of invoices and eliminate the various inconveniences as well as risks caused by artificial reimbursement, this paper creatively combines blockchain technology with electronic invoices. This system realizes interactive flows of paperless invoice for each node from consumption, reimbursement to tax payment through the blockchain network system. Based on the Internet of things technology, the off-chain data can be automatically processed and connected to the on-chain seamlessly. Meanwhile, using a dual-chain structure ensures the subsequent identification and business separation. Through the combination of theory and technical framework, the non-inductive invoice reimbursement system is constructed to reduce the overall reimbursement costs and promoting the improvement of the taxation system in China.", "article_link": "https://doi.org/10.1145/3390566.3391683", "Authors": ["Liu Feng", "Luo Jingyi", "Wu Xuanyong", "Wang Ningbo", "Qin Sishi", "Li Aohua", "Lu Shiying"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "A Tool for Moving Blockchain Computations Off-Chain", "date": "29 May 2021", "abstract": "This paper proposes a new approach and tool for blockchain software developers and architects to use for determining which computations of a smart contract can be effectively done off-chain without loss of trust and how they can be moved off-chain automatically. Our approach uses Finite State Machines (FSMs) and Hierarchical State Machines (HSMs) modeling in order to create smart contract patterns using graphs and then use pattern properties to identify which parts of the smart contracts should be considered for moving off-chain. Once software execution transits into the pattern's entry state, off-chain execution continues until the execution transits into the pattern's exit state, when execution continues on-chain. This paper further describes a tool for (1) FSM input and visualization, its analysis, and automatic transformation into a smart contract, and (2) an interface to support the developers' decision to optimally off-chain computations and to (3) define the communications between on-chain and off-chain computations.", "article_link": "https://doi.org/10.1145/3457337.3457848", "Authors": ["Christian Liu", "Peter Bodorik", "Dawn Jutla"], "Publisher": "Association for Computing Machinery", "Qualifiers": "short-paper", "ISSN": "9781450384001", "nombredePage": "117  pages"},
{"title": "Research on Application of Blockchain Technology in Cloud-Network Collaboration", "date": "29 May 2020", "abstract": "With the deep integration of blockchain, cloud computing and 5G technology, the business model of the Internet is also undergoing subversive changes. Based on the current development trends of the industry, this article illustrates the application prospects of blockchain technology in cloud-network collaboration For users to purchase network services, blockchain technology and consensus accounting are adopted to effectively avoid uploading user data to the Internet company's cloud server, thereby protecting user privacy from threats. This article provides a solution that uses blockchain technology in cloud-network collaboration to ensure transaction security. At the same time, it analyzes the consensus mechanism for the actual application scenario, and selects a consensus mechanism which is suitable for the cloud-network collaborative application scenario.", "article_link": "https://doi.org/10.1145/3390566.3391675", "Authors": ["Min Tan", "Guo-hui Li", "Ming Wei", "Fei Huang", "Li Zhang", "Xiang Hu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377676", "nombredePage": "166  pages"},
{"title": "Distributed Community Detection over Blockchain Networks Based on Structural Entropy", "date": "02 July 2019", "abstract": "Blockchain technology provides a groundbreaking computing paradigm that tackles problems in a completely decentralised manner. As the underlying infrastructure and protocol of blockchain, blockchain networks convey communications and coordination across all involving participants. In extensive application scenarios, conducting community detection over blockchain networks has potential effects on both discovering hidden information and enhancing communicating efficiency. However, the decentralised nature poses a restriction on community detection over blockchain networks. In coping with this restriction, we propose a distributed community detection method based on the Propose-Select-Adjust (PSA) framework that runs in an asynchronous way. We extend the PSA framework using the concept of structural entropy and aim to detect a community structure with low entropy. We test our entropy-based distributed community detection algorithm on both benchmark networks and bitcoin trust networks. Experimental results reveal that our algorithm successfully detects communities with low structural entropy.", "article_link": "https://doi.org/10.1145/3327960.3332381", "Authors": ["Yang Chen", "Jiamou Liu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450367868", "nombredePage": "134  pages"},
{"title": "Blockchain-based Reputation Evaluation Using Game Theory in Social Networking", "date": "30 May 2022", "abstract": "Reputation evaluation is one of vital elements in contemporary social network-based applications. A common type of evaluation method is relying on the third party or a community-based rating. However, this type of method is encountering an issue caused by fake comments posted by adversaries. In this paper, we propose a blockchain-based reputation evaluation approach that uses game theory to address the ghost commentator issue. Over the blockchain network, our approach establishes a reputation-based personal credit evaluation system, in which participants' strategies and payoffs are modeled. A smart contract-based deposit incentive mechanism is developed. We have implemented an experimental evaluation to show the evidence to the performance of our approach.", "article_link": "https://doi.org/10.1145/3494106.3528681", "Authors": ["Wenjie Guo", "Jingfeng Xue", "Yong Wang", "Zhixiong Zhou"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450391757", "nombredePage": "153  pages"},
{"title": "Evaluation of Approaches for Designing and Developing Decentralized Applications on Blockchain", "date": "25 November 2020", "abstract": "Blockchain as a novel technology has shown the capacity to transform multiple sectors. Due to opportunities such as data security, transparency, privacy and interoperability presented by decentralized applications on blockchain networks, organizations are now moving their inter-organizational functions to blockchain-based systems. Traditional system-design methods are not suitable for developing blockchain systems since they are not capable of capturing new functions that are associated with decentralized applications. This paper seeks to address this gap by exploring existing design methods and frameworks that support the development of decentralized application on a blockchain. To achieve this, case-study based research is used in identifying current software-development techniques used in designing decentralized applications (DApp). Experts in this field are interviewed to identify their chosen techniques for designing and developing block-chain applications. Furthermore, related literature is selected to identify current techniques for DApp-designs based on the state of the art. A systematic analysis of the identified techniques is conducted using the current limitations of blockchain technology as criteria for the analyses. Finally, based on the findings of this study, we propose a new model-driven framework for designing blockchain applications.", "article_link": "https://doi.org/10.1145/3423390.3426724", "Authors": ["Chibuzor Udokwu", "Henry Anyanka", "Alex Norta"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377324", "nombredePage": "109  pages"},
{"title": "Evaluating complexity and digitizability of regulations and contracts for a blockchain application design", "date": "27 May 2018", "abstract": "Blockchain technology becomes the key solution to provide trust and security without any need for a central supervisory authority to validate the transactions. By now, it plays a key role in the digital transformation of several processes and industries with varying application use cases. To promote the wide adoption of blockchain technology we need mechanisms to identify the digitizability level of the given regulations to smart contracts and mechanisms to specify which blockchain technology is best suitable for the given regulations. In this work, we propose a modeling approach that supports the automated analysis of human-readable regulation representations by suggesting how much percentage of regulation is digitizable and the suitable blockchain environment to design the application. We identify smart contract components that correspond to real-world entities and its pertaining clauses and its digitizability property. With selected examples, we explore this capability and discuss our future research directions on smart contract generation according to the recommended environment.", "article_link": "https://doi.org/10.1145/3194113.3194117", "Authors": ["Pradeepkumar D S", "Kapil Singi", "Vikrant Kaulgud", "Sanjay Podder"], "Publisher": "Association for Computing Machinery", "Qualifiers": "short-paper", "ISSN": "9781450357265", "nombredePage": "70  pages"},
{"title": "Blockchain-enabled Data Provenance in Cloud Datacenter Reengineering", "date": "02 July 2019", "abstract": "Cloud datacenter reengineering has become an emerging technical term along with the rapid growth of cloud computing. There are a few reasons for implementing cloud reengineering. One of the key driven forces of adopting cloud reengineering is that securing data provenance is a major restriction for most contemporary applications. Many cloud-based applications require multiple cloud vendors' collaborations, such that data usage can be rarely controlled or governed during the data life cycle. This work focuses on the issue of data provenance in cloud computing and proposes an approach that uses blockchain techniques to achieve data tracing for a full data life cycle. The proposed method em- phasizes tracing data transfers between cloud datacenter. The data regeneration also is concerned by the proposed approach. Our experiment evaluation has assessed the efficiency performance of our approach.", "article_link": "https://doi.org/10.1145/3327960.3332382", "Authors": ["Haochen Li", "Keke Gai", "Zhengkang Fang", "Liehuang Zhu", "Lei Xu", "Peng Jiang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450367868", "nombredePage": "134  pages"},
{"title": "An Advanced PBFT-based Consensus Algorithm for a Bidding Consortium Blockchain", "date": "20 July 2021", "abstract": "The rapid development of blockchain technology has given rise to many applications like digital currency. Building a consortium blockchain for a bidding system is a promising way to benefit the bidding businesses, by reducing cost and sharing data among tenderers and bidders. Generally, Practical Byzantine Fault Tolerance (PBFT) algorithm is the wide-ly-used consensus algorithm in a consortium blockchain. However, this algorithm meets its bottleneck, when there are a large number of nodes in the consortium blockchain net-work. In order to enhance the scalability of the consensus algorithm, this paper puts for-ward an advanced PBFT-based consensus algorithm, named ANPBFT, by taking ad-vantages of the message aggregation technology and tree topology technology. Specially, the consensus nodes in our proposed algorithm are divided into active nodes and passive nodes. Then, the consensus of block information is equivalent to the confirmation of iden-tity aggregation signature and aggregation promise of information key. The experimental results show that our proposed algorithm has better performance than the original PBFT algorithm. It also shows good scalability and can be used in a large-scale license-chain system.", "article_link": "https://doi.org/10.1145/3460537.3460552", "Authors": ["Liang Du", "Yuan Tao", "Tianmei Chen", "Qing Wang", "Hanyu Lv"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "Blockchain Technology Adoption via Contractual Coordination Mechanisms", "date": "21 March 2021", "abstract": "This paper collects, organizes, and synthesizes existing literature in recent academic journals and case studies related to Blockchain Technology (BT) adoption through Supply Chain (SC) contractual coordination. We shall review the background of SC coordination segments and explain the development of SC coordination challenges with BT introduction. Based on the concepts stated, we discuss the reasons for contractual coordination via cost and revenue sharing contract in the adoption of BT. We close the paper with recommendations for future research in the adoption of BT through contractual coordination mechanism on the global spread SC that is futuristic and practically oriented.", "article_link": "https://doi.org/10.1145/3446983.3446989", "Authors": ["Saidjahon Hayrutdinov", "Ayesha Saeed", "Liu Tong"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450388962", "nombredePage": "80  pages"},
{"title": "Blockchain Technology in Logistics", "date": "07 July 2022", "abstract": "The following paper discusses the impact of using blockchain technology and the possibility of its development in sustainable logistics and supply chain management. The important organizational challenges include increased transportation charges, improvement technology in information management, supply chain services, sustainability measures, government protocols, and enormous databases. Thus, this industry has embraced developing technology such as Cloud computing and the Internet of Things (IoT) which is resulted in transportation fields to enhance automation and decentralization. Security and transparency have far-reaching ramifications in the digital era. This necessitates the industrial revolution of logistics by the advancement of blockchain technology.", "article_link": "https://doi.org/10.1145/3532640.3532662", "Authors": ["Zixi Zhang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "Blockchain framework for IoT data quality via edge computing", "date": "04 November 2018", "abstract": "Smart home presents a challenge in control and monitoring of its wireless sensors networks (WSN) and the internet of things (IoT) devices which form it. The current IoT architectures are centralized, complex, with poor security in its communications and with upstream communication channels mainly. As a result, there are problems with data reliability. These problems include data missing, malicious data inserted, communications network overload, and overload of computing power at the central node. In this paper a new architecture is presented. This architecture based in blockchain introduce the edge computing layer and a new algorithm to improve data quality and false data detection.", "article_link": "https://doi.org/10.1145/3282278.3282282", "Authors": ["Roberto Casado-Vara", "Fernando de la Prieta", "Javier Prieto", "Juan M. Corchado"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450360500", "nombredePage": "38  pages"},
{"title": "Incentivizing Data Quality in Blockchain-Based Systems—The Case of the Digital Cardossier", "date": "09 September 2022", "abstract": "Inspired by an industry initiative to address the celebrated market for lemons (poor-quality used cars), we investigate how incentives for a permissioned blockchain-based system in the automobile ecosystem can be designed to ensure high-quality data storage and use by different stakeholders. The peer-to-peer distributed ledger platform connects organizations and car owners with disparate interests and hidden intentions. While previous literature has chiefly examined incentives for permissionless platforms, we leverage studies about crowdsensing applications to stimulate research on incentives in permissioned blockchains. This article uses the action design research approach to create an incentive system featuring a rating mechanism influenced by data correction measures. Furthermore, we propose relying on certain institutions capable of assessing data generated within the system. This combined approach of a decentralized data correction and an institutionalized data assessment is distinct from similar incentive systems suggested by literature. By using an agent-based model with strategy evolution, we evaluate the proposed incentive system. Our findings indicate that a rating-based revenue distribution leads to markedly higher data quality in the system. Additionally, the incentive system reveals hidden information of the agents and alleviates agency problems, contributing to an understanding of incentive design in inter-organizational blockchain-based data platforms. Furthermore, we explore incentive design in permissioned blockchains and discuss its latest implications.", "article_link": "https://doi.org/10.1145/3538228", "Authors": ["Florian Spychiger", "Claudio J. Tessone", "Liudmila Zavolokina", "Gerhard Schwabe"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "2769-6472", "nombredePage": "124  pages"},
{"title": "A Scheme for Electronic Evidence Sharing Based on Blockchain and Proxy Re-encryption", "date": "25 February 2022", "abstract": null, "article_link": "https://doi.org/10.1145/3510487.3510490", "Authors": ["Zhikun Miao", "Chengxu Ye", "Ping Yang", "Rui Liu", "Bing Liu", "Ying Chen"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450387460", "nombredePage": "183  pages"},
{"title": "Prediction of the Consolidation Delay in Blockchain-based Applications", "date": "09 April 2021", "abstract": "In the last years, blockchains have become a popular technology to store immutable data validated in a peer-to-peer way. Software systems can take advantage of blockchains to publicly store data (organised in transactions) which is immutable by design. The most important consensus algorithm in public blockchains is the proof-of-work in which miners invest a huge computational power to consolidate new data in a ledger. Miners receive incentives for their work, i.e., a fee decided and paid for each transaction. Rational miners aim to maximise the profit generated by the mining activity, and thus choose the transactions offering the highest fee per byte for their consolidation. In this paper, we propose a queueing model to study the relation between the fee offered by a transaction and its expected consolidation time, i.e., the time required to be added to the blockchain by the miners. The solution of the queueing model, although approximate, is computationally and numerically efficient and software systems can use it online to analyse the trade-off between costs and response times. Indeed, a static configuration of the model would not account for the high variations in the blockchain workload and fees offered by other users.", "article_link": "https://doi.org/10.1145/3427921.3450249", "Authors": ["Simonetta Balsamo", "Andrea Marin", "Isi Mitrani", "Nicola Rebagliati"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450381949", "nombredePage": "301  pages"},
{"title": "Blockchain Solutions in Education: A New Cross-Education Blockchain-Based Framework", "date": "05 January 2021", "abstract": "Variant blockchain-based solutions were proposed during the last 5 years for education. This paper is the first to discuss these solutions and their usage and benefits. However, there is not yet any solution in the literature that issues or validates a certificate which includes courses from different educational institutes. This paper proposes a novel framework for cross-education blockchain-based solution. It collects participating institutes in one blockchain network. Graduates of this solution can join courses in the institutes that provide the latest and strongest contents. The issued certificate is self-validating for all the courses that are obtained from multiple institutes. It is cryptographically coded and securely stored using the blockchain technology. It can be validated instantaneously through one validation portal independently without contacting its issuing institutes. The saved time and resources are oriented toward enhancing students' services. This framework can be extended to fields that require issuing or validating cross-acquired certificates.", "article_link": "https://doi.org/10.1145/3436829.3436872", "Authors": ["Eman Sayed"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450377218", "nombredePage": "251  pages"},
{"title": "An Efficient Supply Chain Architecture Based on Blockchain for High-value Commodities", "date": "02 July 2019", "abstract": "The blockchain is the innovative technology in recent year. It brings a revolution to both industrial and academic area. In fact, it is a distributed storage system based on cryptography and consensus algorithms. Currently, many applications have been implemented in finance, agriculture, payment, and medicine area. We proposed a platform called High-value Commodities as a Service (HCS) to combine blockchain and high-value assets together. Traditionally, real estates, jewelry and artworks are main luxuries word-widely. We provide a sound and reliable environment for those investors to trade. Due to characteristics of the blockchain, users on our platform can track the source for each item. And all private data would be pushed on chains which can avoid some privacy-related problems.", "article_link": "https://doi.org/10.1145/3327960.3332384", "Authors": ["Zhiyu Xu", "Tengyun Jiao", "Qin Wang", "Cuong Bui Van", "Sheng Wen", "Yang Xiang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450367868", "nombredePage": "134  pages"},
{"title": "Optimization of Student Physical Health Data Cycle under Computer Blockchain Technology", "date": "29 October 2022", "abstract": "With the rapid development of computer technology and network technology, various industries are actively utilizing modern technology, especially the application of blockchain technology. For several years since the implementation of students' physical fitness testing in my country, there have been problems such as insufficient reliability, data distortion, enormous workload of supervision and evaluation, and insufficient data application in students' physical health data. It is particularly necessary to apply the blockchain technology with the characteristics of decentralization, time stamping, not easy to tamper, and contract autonomy to the student physical health data platform. This paper uses the literature method, statistical analysis method and other research methods to discuss the optimization of student health data cycle in terms of data collection, reporting, database sharing guarantee, and feedback. With the help of computer blockchain technology, optimizing the circulation of health data, realizing accurate data collection, real-time uploading, autonomous management and control, and efficient intervention, has certain practical value and display significance.", "article_link": "https://doi.org/10.1145/3559795.3559804", "Authors": ["Yan Rao", "Qin Wang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450396622", "nombredePage": "143  pages"},
{"title": "TChain: A Privacy-Preserving Consortium Blockchain for Parking Charge Management", "date": "20 July 2021", "abstract": "With the rapid development of intelligent transportation system, parking charge management shows a trend of digitization and intelligence, which improves the efficiency and brings great convenience in parking charge service. Nevertheless, exposure of vehicle-track and traffic transaction information become potential threats that have been ignored by most parking management system. In building intelligent transportation systems, privacy and security issues should be addressed first. In this paper, we propose a hierarchical consortium blockchain TChain and build our practical solutions with parking charges as a typical scenario, which contains on-chain and off-chain ledger interaction model. Specifically, to prevent malicious collection and use of on-chain information, we introduce Pedersen commitment and Token mechanism to anonymize the content of blockchain data and conceal the relationships of transactions. Besides, we analyze and perform a series of vital experiments to verify the effectiveness and security of our proposed solution.", "article_link": "https://doi.org/10.1145/3460537.3460546", "Authors": ["Zhe Feng", "Lijun Wei", "Yuhan Yang", "Jing Wu", "Chengnian Long"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"},
{"title": "A Video Copyright Transaction Traceability Method Based on Mother-Child Blockchain", "date": "21 March 2021", "abstract": "The paper proposes a video copyright transaction traceability method (TTMC) based on the parent-child chain. The video production process records and the video traceability source code records that can uniquely identify the video are recorded on the private blockchain (child chain). The alliance blockchain (parent in the chain), the nodes that are authenticated by the member nodes can conduct video media resource copyright information transactions and traceability. First, the parent chain member node is authenticated, and after the authentication, the copyright transaction and the traceability system can be accessed; secondly, the member node stores each step of information in the child chain when making the video for rights certification; then the video is watermarked and obtained Video fingerprint, calculate the video ID for each video, smart contract automatically uses the matching algorithm based on the mother-child chain distributed architecture to automatically complete the transaction. Simulation experiments show that the method proposed in this paper is effective in tracing the source of video copyright transactions.", "article_link": "https://doi.org/10.1145/3446983.3446984", "Authors": ["Yang Yang", "Dingguo Yu", "Rongbo Zhang", "Yanqin Yan"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450388962", "nombredePage": "80  pages"},
{"title": "A Blockchain-Based Cross-Domain Data Sharing Scheme for VANETs", "date": "07 July 2022", "abstract": "Recently, the rapid development of 5G communication technology enables the interaction and data sharing in the vehicular ad-hoc networks, which further improves the vehicular safety and travel efficiency. However, the current researches of vehicular data sharing and management only focus on a single domain, while fail to adapt to the multi-domain scenarios. Moreover, the issues of privacy preserving and resistance of attacks are also not considered. To this end, we propose a hierarchical data sharing and management system for vehicular ad-hoc networks by combining blockchain and trusted execution environments to achieve transparent data transmission and privacy preserving, wherein the consortium blockchain is regarded as the underlying platform, and the trusted execution environments using Intel SGX is leveraged to guarantee the secure execution of smart contract. Finally, the security analysis and performance evaluation are provided to show that our system can perform well in terms of privacy preserving and data sharing efficiency.", "article_link": "https://doi.org/10.1145/3532640.3532656", "Authors": ["Juhao Hu", "Yuhan Yang", "Jing Wu", "Chengnian Long"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "Non-Blocking Two Phase Commit Using Blockchain", "date": "15 June 2018", "abstract": "Though the 2 Phase Commit protocol (2PC) remains central to distributed database management, it has a provably-inevitable vulnerability to blocking even when a distributed system guarantees the most demanding synchrony or timing-related requirements. This paper investigates eliminating that vulnerability by coordinating 2PC using a blockchain that supports execution of user-defined smart contracts. It demonstrates that the 2PC blocking can be eliminated at a moderate financial cost, if the blockchain also meets the synchrony requirements. Otherwise, despite the blockchain being a reliable state-machine, eliminating 2PC blocking may well be impossible, depending on whether the cluster hosting the database is synchronous or not. Where not possible, the practical consequences turn out to be not so serious: unnecessary aborts occurring with a small probability.", "article_link": "https://doi.org/10.1145/3211933.3211940", "Authors": ["Paul Ezhilchelvan", "Amjad Aldweesh", "Aad van Moorsel"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450358385", "nombredePage": "121  pages"},
{"title": "Poster: Blockchain-Envisioned Secure Generic Communication Framework using Signcryption", "date": "08 June 2022", "abstract": "We aim at building a generic future-generation, secure communication framework on top of blockchain using signcryption. A publicly verifiable signcryption scheme not only ensures data confidentiality and authentication, but also enables messages to be verified or audited non-interactively. With blockchain as trustworthy computation and storage services, the proposed secure communication framework achieves tamper-resistance, non-repudiation, availability and public verification. Moreover, we consider both large-size data (e.g., file) and small-size data (e.g., cryptographic hash or key) transfer paradigms, where blockchain and signcryption schemes are seamlessly combined. In particular, IPFS is used as a hash oracle and decentralized storage platform in big data transfer.", "article_link": "https://doi.org/10.1145/3532105.3535034", "Authors": ["Liang Zhang", "Haibin Kan", "Yuan Li", "Jinrong Huang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "poster", "ISSN": "9781450393577", "nombredePage": "282  pages"},
{"title": "LBLCO: A Lightweight Blockchain with Low Communication Overhead for Internet of Things", "date": "29 October 2022", "abstract": "With the increasing demand for Internet of things (IOT) applications, more devices need to be added to IOT. IOT system using centralized server mode face great security challenges. Blockchain, based on distributed ledger technology, could be a good solution. In order to combine blockchain technology and IOT applications appropriately, this paper proposes a lightweight blockchain with low communication overhead (LBLCO). A new consensus algorithm named proof of repute score based on hidden block (HBPORS) is proposed in LBLCO. The nodes with higher repute score will be more likely to become winner in HBPORS. The repute score mechanism dynamically update the repute score of the nodes according to the contribution and evil behavior of the node in the blockchain system. When the honest node with high repute score obtains the accounting right, it can trigger the hidden block mechanism. Instead of broadcasting the complete information of the packaged block to all nodes, winners can broadcast the low overhead information to other nodes. Through experimental tests, LBLCO can meet the requirements of large number of nodes and fast response speed in the IOT.", "article_link": "https://doi.org/10.1145/3559795.3559808", "Authors": ["Chao Chen", "Mingzhe Liu", "Peijun Mo", "Cuixu Yuan", "Pengyu Dai"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450396622", "nombredePage": "143  pages"},
{"title": "Towards Rich Qery Blockchain Database", "date": "19 October 2020", "abstract": "In this demo, we present SEBDB, a novel blockchain database that integrates immutability and transparency properties of blockchain with modeling and query ability of relational database. In summary, SEBDB has the following advantages: First, it adopts the linked structure and full replication of data among multiple participants to guarantee immutability and transparency. Second, it introduces the relational model to blockchain without introducing extra overhead, based on which relational queries are supported. SEBDB supports SQL-like language as the general interface to support convenient application development, in which intrinsic operations are re-defined and re-implemented to suit for blockchain platform. Third, it supports rich verifiable queries based on the proposed authenticated index, thin clients can participate in the system regardless of limitations of storage, network, and computing resources. We demonstrate the usability and scalability of SEBDB using a donation system.", "article_link": "https://doi.org/10.1145/3340531.3417424", "Authors": ["Yanchao Zhu", "Zhao Zhang", "Cheqing Jin", "Aoying Zhou", "Gang Qin", "Yingjie Yang"], "Publisher": "Association for Computing Machinery", "Qualifiers": "short-paper", "ISSN": "9781450368599", "nombredePage": "3619  pages"},
{"title": "Research on the construction of health food system based on Blockchain Technology", "date": "07 July 2022", "abstract": "For the management of health food, it mainly collects, reports and summarizes health food data, establishes a database and data center, carries out analysis, processing and in-depth mining by using big data analysis means such as data mining and prediction analysis, finds and focuses on the existing problems and system direction, and puts forward the construction scheme of health food system based on blockchain technology, Provide decision-making basis and technical support for government departments to further develop and optimize the health food market.", "article_link": "https://doi.org/10.1145/3532640.3532660", "Authors": ["Chenggong Zhai", "Yan Li", "Xiang Lai", "Shan Cheng", "Xiaoqing Hu", "Rangming Wu"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450395762", "nombredePage": "177  pages"},
{"title": "A Survey of Blockchain Applications in Different Domains", "date": "10 December 2018", "abstract": "Blockchains have received much attention recently since they provide decentralized approaches to the creation and management of value. Many banks, Internet companies, car manufacturers, and even governments worldwide have incorporated or started considering blockchains to improve the security, scalability, and efficiency of their services. In this paper, we survey blockchain applications in different areas. These areas include cryptocurrency, healthcare, advertising, insurance, copyright protection, energy, and societal applications. Our work provides a timely summary for individuals and organizations interested in blockchains. We envision our study to motivate more blockchain applications.", "article_link": "https://doi.org/10.1145/3301403.3301407", "Authors": ["Wubing Chen", "Zhiying Xu", "Shuyu Shi", "Yang Zhao", "Jun Zhao"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450366465", "nombredePage": "32  pages"},
{"title": "Towards Secure and Scalable Blockchain Technologies", "date": "25 May 2021", "abstract": "The blockchain technology is rapidly gaining grounds as a key technology, especially in the financial and supply chain management sectors. This is largely due to the ability of the technology to (i) efficiently manage the sharing of digital resources between a large number of stakeholders and (ii) to efficiently manage disputes arising in the process. In spite of its many advantages, experience with existing blockchain proposals reveals that there are still many challenges that need to be overcome prior to any large scale industrial adoption, namely [Scalability] Existing permissionless blockchains (e.g., Bitcoin) are able to scale to a considerable number of nodes at the expense of attained throughput (e.g., Bitcoin can only achieve few transactions per second[2]). On the other hand, permission-based blockchains can achieve relatively higher throughput, but can only scale to few hundred nodes. However, one needs to cater for both performance and scalability to meet industrial standards. [Privacy of lightweight clients] Most open blockchain platforms support lightweight clients, targeted for devices like smartphones, that only download and verify a small part of the chain. Here, clients connect to a full node that has access to the complete blockchain and can assist the client in transaction confirmation. As the full node has to learn all transactions issued and received by the requesting client to verify their correctness, such action obviously violates user privacy[1]. In this talk, we plan to overview a number of security challenges pertaining to existing blockchains-effectively capturing almost 8 years of research in this area of work. Moreover, we plan to discuss the performance limitations of existing blockchain-based consensus algorithms and explore different concepts leveraging trusted execution environments (TEEs) to enhance the scalability and security of existing consensus algorithms[3]. Finally, we will discuss the privacy provisions of existing lightweight client implementations and explore the solution space to enhance user privacy by leveraging functionality from TEEs[4].", "article_link": "https://doi.org/10.1145/3457977.3460634", "Authors": ["Ghassan Karame"], "Publisher": "Association for Computing Machinery", "Qualifiers": "keynote", "ISSN": "9781450384056", "nombredePage": "40  pages"},
{"title": "Preventing Spoliation of Evidence with Blockchain: A Perspective from South Asia", "date": "20 July 2021", "abstract": "Evidence destruction and tempering is a time-tested tactic to protect the powerful perpetrators, criminals, and corrupt officials. Countries where law enforcing institutions and judicial system can be comprised, and evidence destroyed or tampered, ordinary citizens feel disengaged with the investigation or prosecution process, and in some instances, intimidated due to the vulnerability to exposure and retribution. Using Distributed Ledger Technologies (DLT), such as blockchain, as the underpinning technology, here we propose a conceptual model – ‘EvidenceChain’, through which citizens can anonymously upload digital evidence, having assurance that the integrity of the evidence will be preserved in an immutable and indestructible manner. Person uploading the evidence can anonymously share it with investigating authorities or openly with public, if coerced by the perpetrators or authorities. Transferring the ownership of evidence from authority to ordinary citizen, and custodianship of evidence from susceptible centralized repository to an immutable and indestructible distributed repository, can cause a paradigm shift of power that not only can minimize spoliation of evidence but human rights abuse too. Here the conceptual model was theoretically tested against some high-profile spoliation of evidence cases from four South Asian developing countries that often rank high in global corruption index and low in human rights index.", "article_link": "https://doi.org/10.1145/3460537.3460550", "Authors": ["Ali Shahaab", "Chaminda Hewage", "Imtiaz Khan"], "Publisher": "Association for Computing Machinery", "Qualifiers": "research-article", "ISSN": "9781450389624", "nombredePage": "216  pages"}
]